{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "07017481",
   "metadata": {},
   "source": [
    "This notebook creates two subgraphs from the Booksampo SW, \n",
    "- one for novels written in Finnish, and \n",
    "- one for novels written in another language but translated into Finnish\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "6d76d615",
   "metadata": {},
   "outputs": [],
   "source": [
    "# import packages\n",
    "\n",
    "from collections import defaultdict, OrderedDict, Counter\n",
    "from datetime import datetime\n",
    "\n",
    "from dateutil.relativedelta import relativedelta\n",
    "import glob\n",
    "from itertools import product, combinations\n",
    "import matplotlib.pyplot as plt\n",
    "import numpy    as np\n",
    "#import networkx as nx\n",
    "from operator import itemgetter\n",
    "import pandas   as pd\n",
    "import rdflib as rdflib\n",
    "import re\n",
    "from scipy.signal import convolve2d\n",
    "import seaborn as sns\n",
    "from sklearn.preprocessing import MultiLabelBinarizer, minmax_scale\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON, POST, TURTLE\n",
    "import sys\n",
    "from rdflib.namespace import XSD, Namespace\n",
    "from rdflib.term import URIRef\n",
    "\n",
    "import IPython\n",
    "import pprint\n",
    "pp = pprint.PrettyPrinter(indent=4)\n",
    "\n",
    "\n",
    "\n",
    "from constants import *\n",
    "from helpers import *"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "831f71bd",
   "metadata": {},
   "outputs": [],
   "source": [
    "# \n",
    "from rdflib import Graph\n",
    "\n",
    "from rdflib.namespace import RDF, SKOS\n",
    "rel = rdflib.Namespace('http://ldf.fi/relse/')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "4d246a65",
   "metadata": {},
   "outputs": [],
   "source": [
    "# colors\n",
    "import matplotlib.colors as mcolors\n",
    "from matplotlib import cm\n",
    "# set style\n",
    "import seaborn as sns\n",
    "\n",
    "# set theme for visualizations\n",
    "sns.set_theme(style=\"white\",palette=\"PuOr_r\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "981880d9",
   "metadata": {},
   "source": [
    "## Translated novels\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "6950651b",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Query\n",
    "Q = \"\"\"\n",
    "PREFIX rel: <http://ldf.fi/relse/>\n",
    "\n",
    "CONSTRUCT {\n",
    "\n",
    "## novel\n",
    "?teos a rel:novel ;\n",
    "    skos:prefLabel ?title ;\n",
    "    rel:langOrig ?kieliuri ;\n",
    "    rel:hasAuthor ?author ;\n",
    "    rel:pubYear ?vuosi_ .\n",
    "\n",
    "## author\n",
    "?author a rel:author ;\n",
    "\tskos:prefLabel ?authorname ;\n",
    "\tfoaf:gender ?gender ;\n",
    "\trel:authorNationality ?kansallisuusuri .\n",
    "\n",
    "## language\n",
    "?kieliuri a rel:lang ;\n",
    "\tskos:prefLabel ?kieli .\n",
    "\n",
    "## nationality\n",
    "?kansallisuusuri a rel:nationality ;\n",
    "\tskos:prefLabel ?kansallisuus. \n",
    "\n",
    "}\n",
    "\n",
    "WHERE {\n",
    "\n",
    "  ?teos a kaunokki:romaani ; skos:prefLabel ?title .\n",
    "  ?teos kaunokki:alkukieli ?kieliuri .\n",
    "  FILTER (?kieliuri !=  <http://lexvo.org/id/iso639-3/fin>  ) # original language not Finnish\n",
    "  OPTIONAL {?kieliuri skos:prefLabel ?kieli . }\n",
    "  ?teos kaunokki:manifests_in ?julkaisu .\n",
    "  ?julkaisu kaunokki:kieli <http://lexvo.org/id/iso639-3/fin> . # translated into Finnish\n",
    "  FILTER EXISTS {?julkaisu kaunokki:kieli <http://lexvo.org/id/iso639-3/fin>  }\n",
    "  ?julkaisu kaunokki:ilmestymisvuosi ?vuosi . ?vuosi skos:prefLabel ?vuosiluku .\n",
    "  BIND(xsd:integer(?vuosiluku) AS ?vuosi_)\n",
    "  \n",
    "  # the novel has to have an author\n",
    "  ?teos kaunokki:tekija ?author.\n",
    "  ?author skos:prefLabel ?authorname .\n",
    "OPTIONAL {?author kaunokki:kansallisuus ?kansallisuusuri . OPTIONAL { ?kansallisuusuri skos:prefLabel ?kansallisuus .} }\n",
    "OPTIONAL  {?author foaf:gender ?gender }\n",
    "\n",
    "\n",
    "} \n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "044b709c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "*** constructing the graph\n"
     ]
    }
   ],
   "source": [
    "# construct graph based on the query\n",
    "\n",
    "# query graph\n",
    "print('\\n\\n*** constructing the graph')\n",
    "sparql = SPARQLWrapper(\"http://ldf.fi/booksampo-2022/sparql\")\n",
    "\n",
    "sparql.setQuery(PREFIXES + Q)\n",
    "\n",
    "sparql.addCustomHttpHeader(*list(AUTHORIZATION_HEADER.items())[0])\n",
    "\n",
    "sparql.setReturnFormat(TURTLE)\n",
    "results = sparql.query().convert()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "dffa0be2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=N15744ebf765c4cd9a1ed21b0aa1f95a8 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# parse\n",
    "\n",
    "from rdflib import Graph\n",
    "g = Graph()\n",
    "#g.parse(data=results, format=\"turtle\") # \"mygraph.ttl\"\n",
    "g.parse(data=results, format=\"turtle\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "id": "523a5aff",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=Nae544eb22f6243d2aabd69c1fd567e8c (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 54,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# g correct\n",
    "# foreign\n",
    "#g = Graph() \n",
    "#g.parse('../../data/nat_lang_graph.nt')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "352ddbb8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "found 24963 novels\n",
      "['http://www.yso.fi/onto/kaunokki#ateos_9249', 'http://data.kirjasampo.fi/abstractWork_4344055', 'http://seco.tkk.fi/saha3/u604b23fa-41eb-44f6-8368-1a09df1209d4', 'http://seco.tkk.fi/saha3/ud9041e8c-63c5-4808-9a7c-5d03826f9e3c', 'http://data.kirjasampo.fi/abstractWork_7177234']\n"
     ]
    }
   ],
   "source": [
    "# find all novels, see how many there are\n",
    "\n",
    "from rdflib.namespace import RDF, SKOS\n",
    "rel = rdflib.Namespace('http://ldf.fi/relse/') \n",
    "\n",
    "novels=[]\n",
    "for s, p, o in g.triples((None,  None, None)):\n",
    "    #print(o)\n",
    "    if o ==rel.novel:\n",
    "        #print(str(s))\n",
    "        novels.append(str(s))\n",
    "    #print(f\"{s} is a  novel\")\n",
    "    \n",
    "print(\"found\" ,len(set(novels)), \"novels\")\n",
    "print(novels[:5])\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "af9d2a16",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://www.yso.fi/onto/kaunokki#ateos_9249 http://www.w3.org/1999/02/22-rdf-syntax-ns#type http://ldf.fi/relse/novel\n",
      "http://www.yso.fi/onto/kaunokki#ateos_9249 http://ldf.fi/relse/langOrig http://lexvo.org/id/iso639-3/eng\n",
      "http://www.yso.fi/onto/kaunokki#ateos_9249 http://www.w3.org/2004/02/skos/core#prefLabel Kolme morsianta\n",
      "http://www.yso.fi/onto/kaunokki#ateos_9249 http://www.w3.org/2004/02/skos/core#prefLabel The Judas Kiss\n",
      "http://www.yso.fi/onto/kaunokki#ateos_9249 http://ldf.fi/relse/hasAuthor http://www.yso.fi/onto/kaunokki#person_123175975389690\n",
      "http://www.yso.fi/onto/kaunokki#ateos_9249 http://ldf.fi/relse/pubYear 1982\n",
      "http://www.yso.fi/onto/kaunokki#ateos_9249 http://www.w3.org/2004/02/skos/core#prefLabel Judaskyssen\n"
     ]
    }
   ],
   "source": [
    "# check one as an example to see that the stored information is correct\n",
    "\n",
    "for s, p, o in g.triples((None,  None, None)):\n",
    "    #print(o)\n",
    "    if str(s) == 'http://www.yso.fi/onto/kaunokki#ateos_9249':\n",
    "    \n",
    "        print(s,p,o)\n",
    "        \n",
    "    \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "bb287b99",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('http://www.btj.fi/at_1678175', 'Petra Delicado ja merkityt tytöt'),\n",
       " ('http://data.kirjasampo.fi/abstractWork_9789518830927',\n",
       "  'Piraatti-Pete ja hirmuiset merirosvot'),\n",
       " ('http://www.yso.fi/onto/kaunokki#ateos_9589', 'Ensimmäinen kotka'),\n",
       " ('http://www.yso.fi/onto/kaunokki#ateos_3912', 'Yön suojissa'),\n",
       " ('http://data.kirjasampo.fi/abstractWork_6834230', \"The orphan's tale\"),\n",
       " ('http://data.kirjasampo.fi/abstractWork_4124516', 'The ordinary princess'),\n",
       " ('http://www.yso.fi/onto/kaunokki#ateos_2216', 'Mieheni oli kommunisti'),\n",
       " ('http://data.kirjasampo.fi/abstractWork_9789511255659', 'Suden hetki'),\n",
       " ('http://seco.tkk.fi/saha3/ue552c4bb-ecd8-495d-be5d-00c45f9caaa8',\n",
       "  'Matka avaruudessa'),\n",
       " ('http://seco.tkk.fi/saha3/ucf938d75-fc5e-4637-9715-73092ba5482a',\n",
       "  'Kadonneet kaverukset')]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# title lookup\n",
    "\n",
    "# query the database for novel titles\n",
    "\n",
    "qres = g.query(\"\"\"\n",
    "PREFIX kaunokki: <http://www.yso.fi/onto/kaunokki#> \n",
    "PREFIX rel: <http://ldf.fi/relse/> \n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX schema: <http://schema.org/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX xml: <http://www.w3.org/XML/1998/namespace>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT ?id ?label\n",
    "WHERE {\n",
    "  ?id a rel:novel ; skos:prefLabel ?label\n",
    "}  \"\"\")\n",
    "\n",
    "title_lookup=dict([(str(url), str(label)) for url, label in qres])\n",
    "\n",
    "list(title_lookup.items())[:10]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "d1f53350",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Author gender known for 24389 out of 24963 novels\n",
      "[('http://www.btj.fi/at_1678175', {'http://www.yso.fi/onto/kaunokki#female'}), ('http://data.kirjasampo.fi/abstractWork_9789518830927', {'http://www.yso.fi/onto/kaunokki#female'}), ('http://www.yso.fi/onto/kaunokki#ateos_9589', {'http://www.yso.fi/onto/kaunokki#male'}), ('http://www.yso.fi/onto/kaunokki#ateos_3912', {'http://www.yso.fi/onto/kaunokki#female'}), ('http://data.kirjasampo.fi/abstractWork_6834230', {'http://www.yso.fi/onto/kaunokki#female'}), ('http://data.kirjasampo.fi/abstractWork_4124516', {'http://www.yso.fi/onto/kaunokki#female'}), ('http://www.yso.fi/onto/kaunokki#ateos_2216', {'http://www.yso.fi/onto/kaunokki#male'}), ('http://data.kirjasampo.fi/abstractWork_9789511255659', {'http://www.yso.fi/onto/kaunokki#female'}), ('http://seco.tkk.fi/saha3/ue552c4bb-ecd8-495d-be5d-00c45f9caaa8', {'http://www.yso.fi/onto/kaunokki#male'}), ('http://seco.tkk.fi/saha3/u99617114-2455-49e4-8bed-05851eb04a3f', {'http://www.yso.fi/onto/kaunokki#male'})] [('http://www.yso.fi/onto/kaunokki#ateos_51440', 'unk'), ('http://www.yso.fi/onto/kaunokki#ateos_97', 'unk'), ('http://seco.tkk.fi/saha3/ua41cbc5a-90bd-4513-9863-ccc4d8b9134e', 'unk'), ('http://seco.tkk.fi/saha3/ua427e15d-a8b5-44dc-904f-43fda0e118c7', 'unk'), ('http://seco.tkk.fi/saha3/u8c6259e0-4c7c-4885-b2bb-fe68194bfa60', 'unk'), ('http://seco.tkk.fi/saha3/u74ce0b34-fb9b-4b10-a4e9-084ef55f2152', 'unk'), ('http://seco.tkk.fi/saha3/ueee69328-35db-4c2d-9f9e-384d5ffea75d', 'unk'), ('http://seco.tkk.fi/saha3/u599eb9c8-23ad-46f1-8930-2ea3bdcb3f10', 'unk'), ('http://seco.tkk.fi/saha3/u8ee1e8d3-6b9d-462e-b705-073b565a1cff', 'unk'), ('http://www.yso.fi/onto/kaunokki#ateos_19745', 'unk')]\n"
     ]
    }
   ],
   "source": [
    "# gender lookup\n",
    "\n",
    "# query gender for each author\n",
    "\n",
    "qres = g.query(\"\"\"\n",
    "#PREFIX kaunokki: <http://www.yso.fi/onto/kaunokki#> \n",
    "PREFIX rel: <http://ldf.fi/relse/> \n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX schema: <http://schema.org/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX xml: <http://www.w3.org/XML/1998/namespace>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT ?teos ?gender\n",
    "WHERE {\n",
    "  ?teos a rel:novel ; rel:hasAuthor ?author. \n",
    "  ?author foaf:gender ?gender .\n",
    "}  \"\"\")\n",
    "\n",
    "gender_lookup=defaultdict(set)\n",
    "\n",
    "for url, label in qres:\n",
    "    gender_lookup[str(url)].update([str(label)])\n",
    "\n",
    "gendernovels=len(gender_lookup.keys()) \n",
    "\n",
    "gender_lookup2 = {novel:\"unk\" for novel in novels if novel not in gender_lookup.keys() }\n",
    "gender_lookup.update(gender_lookup2)\n",
    "print(\"Author gender known for\", gendernovels,\"out of\" ,len(gender_lookup), \"novels\")\n",
    "print(list(gender_lookup.items())[:10],list(gender_lookup.items())[-10:])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "14737130",
   "metadata": {},
   "source": [
    "## Correct nationalities"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ba3df983",
   "metadata": {},
   "source": [
    "Remove/unify duplicates and unnecessary nationalities found in the data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "13ccc609",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Author nationality known for 23549 / 24963 novels \n",
      "\n",
      "[('http://www.btj.fi/at_1678175', {'http://www.yso.fi/onto/koko/p13629'}), ('http://data.kirjasampo.fi/abstractWork_9789518830927', {'http://www.yso.fi/onto/koko/p2224'}), ('http://www.yso.fi/onto/kaunokki#ateos_9589', {'http://www.yso.fi/onto/koko/p73101'}), ('http://www.yso.fi/onto/kaunokki#ateos_3912', {'http://www.yso.fi/onto/koko/p73101'}), ('http://data.kirjasampo.fi/abstractWork_6834230', {'http://www.yso.fi/onto/koko/p73101'}), ('http://www.yso.fi/onto/kaunokki#ateos_2216', {'http://www.yso.fi/onto/koko/p73101'}), ('http://data.kirjasampo.fi/abstractWork_9789511255659', {'http://www.yso.fi/onto/koko/p73101'}), ('http://seco.tkk.fi/saha3/ue552c4bb-ecd8-495d-be5d-00c45f9caaa8', {'http://www.yso.fi/onto/koko/p73101'}), ('http://seco.tkk.fi/saha3/ucf938d75-fc5e-4637-9715-73092ba5482a', {'http://www.yso.fi/onto/koko/p54872'}), ('http://seco.tkk.fi/saha3/u99617114-2455-49e4-8bed-05851eb04a3f', {'http://www.yso.fi/onto/koko/p3437'})] [('http://www.yso.fi/onto/kaunokki#ateos_7919', 'unk'), ('http://www.yso.fi/onto/kaunokki#ateos_12091', 'unk'), ('http://seco.tkk.fi/saha3/u01fdc545-2ad2-4870-ba54-e9c7177a7262', 'unk'), ('http://www.yso.fi/onto/kaunokki#ateos_12919', 'unk'), ('http://www.yso.fi/onto/kaunokki#ateos_12708', 'unk'), ('http://www.yso.fi/onto/kaunokki#ateos_7440', 'unk'), ('http://www.yso.fi/onto/kaunokki#ateos_6533', 'unk'), ('http://data.kirjasampo.fi/abstractWork_4291711', 'unk'), ('http://seco.tkk.fi/saha3/u9f32cd96-7cf8-46bd-8800-c9c647fc03b8', 'unk'), ('http://seco.tkk.fi/saha3/u6f441d8b-1b5a-4ae9-ae50-dfd8edaa0295', 'unk')]\n"
     ]
    }
   ],
   "source": [
    "# nationality lookup\n",
    "\n",
    "qres = g.query(\"\"\"\n",
    "#PREFIX kaunokki: <http://www.yso.fi/onto/kaunokki#> \n",
    "PREFIX rel: <http://ldf.fi/relse/> \n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX schema: <http://schema.org/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX xml: <http://www.w3.org/XML/1998/namespace>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT ?teos ?nationality\n",
    "WHERE {\n",
    "  ?teos a rel:novel ; rel:hasAuthor ?author. \n",
    "  ?author rel:authorNationality ?nationality .# ?nationality skos:prefLabel ?label.\n",
    "  #FILTER (LANG(?label)=\"fi\")\n",
    "}  \"\"\")\n",
    "\n",
    "#novelnat_lookup=dict([(str(url), str(label)) for url, label in qres])\n",
    "#print(list(gender_lookup.items())[-10:])\n",
    "import collections \n",
    "\n",
    "novelnat=defaultdict(set)\n",
    "for url, label in qres:\n",
    "    novelnat[str(url)].update([str(label)])\n",
    "novelnats=len(novelnat.keys())\n",
    "novelnat_lookup2 = {novel:\"unk\" for novel in novels if novel not in novelnat.keys() }\n",
    "novelnat.update(novelnat_lookup2)\n",
    "\n",
    "# print out the total number of novels with author nationality\n",
    "print(\"Author nationality known for\", novelnats ,\"/\" ,len(novelnat), \"novels \\n\")\n",
    "\n",
    "\n",
    "print(list(novelnat.items())[:10],list(novelnat.items())[-10:])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "d905e6c8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "152\n",
      "[('http://www.yso.fi/onto/koko/p13629', {'espanjalaiset'}), ('http://www.yso.fi/onto/koko/p2224', {'britit'}), ('http://www.yso.fi/onto/koko/p73101', {'yhdysvaltalaiset'}), ('http://www.yso.fi/onto/koko/p54872', {'kanadalaiset'}), ('http://www.yso.fi/onto/koko/p3437', {'ranskalaiset'}), ('http://www.yso.fi/onto/koko/p745', {'saksalaiset'}), ('http://www.yso.fi/onto/koko/p14632', {'alankomaalaiset'}), ('http://www.yso.fi/onto/koko/p6292', {'tanskalaiset'}), ('http://www.yso.fi/onto/koko/p607', {'englantilaiset'}), ('http://seco.tkk.fi/saha3/u996eb3eb-230f-4dc5-b607-8f06acbf66ad', {'libanonilaiset'})] [('http://seco.tkk.fi/saha3/uae9f2b4b-bf6b-4b38-afbe-8d92fa84372c', {'makedonialaiset'}), ('http://seco.tkk.fi/saha3/u4d0f8bfc-1dc4-4d8b-886f-8c4430553d48', {'jamaikalaiset'}), ('http://www.yso.fi/onto/koko/p3295', {'baltit'}), ('http://www.yso.fi/onto/koko/p35074', {'marit'}), ('http://seco.tkk.fi/saha3/ud472f914-dcc0-4ec3-9753-7815d6b15b93', {'norsunluurannikkolaiset'}), ('http://www.yso.fi/onto/koko/p34058', {'karjalaiset'}), ('http://www.yso.fi/onto/koko/p60528', {'Burundi'}), ('http://www.yso.fi/onto/koko/p16395', {'sorbit'}), ('http://seco.tkk.fi/saha3/uadf097fc-3813-4fff-aa30-01de69d746cd', {'kamerunilaiset'}), ('http://seco.tkk.fi/saha3/uea147f18-cc18-4eb9-baf1-6b2161b9bdc1', {'botswanalaiset'})]\n"
     ]
    }
   ],
   "source": [
    "# nationality label lookup\n",
    "\n",
    "qres = g.query(\"\"\"\n",
    "#PREFIX kaunokki: <http://www.yso.fi/onto/kaunokki#> \n",
    "PREFIX rel: <http://ldf.fi/relse/> \n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX schema: <http://schema.org/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX xml: <http://www.w3.org/XML/1998/namespace>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT ?nationality (SAMPLE(?natlabel) AS ?natl)\n",
    "WHERE {\n",
    "  ?teos a rel:novel ; rel:hasAuthor ?author. \n",
    "  ?author rel:authorNationality ?nationality . ?nationality skos:prefLabel ?label.\n",
    "  \n",
    "  FILTER (LANG(?label)=\"fi\") # only labels in Finnish\n",
    "  ?nationality skos:prefLabel ?labelAny.\n",
    "  #BIND( \"unk\" as ?label2)\n",
    "  BIND(COALESCE(?label, ?labelAny) AS ?natlabel )\n",
    "} GROUP BY ?nationality\n",
    "\"\"\")\n",
    "\n",
    "nat_lookup=defaultdict(set)\n",
    "for url, label in qres:\n",
    "    nat_lookup[str(url)].update([str(label)])\n",
    "    \n",
    "\n",
    "print(len(nat_lookup))\n",
    "print(list(nat_lookup.items())[:10],list(nat_lookup.items())[-10:])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "5f5ce302",
   "metadata": {},
   "outputs": [],
   "source": [
    "natlabel_lookup=defaultdict(set)\n",
    "for url, label in qres:\n",
    "    natlabel_lookup[str(label)].update([str(url)])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "e333a580",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "sveitsiläiset ['http://seco.tkk.fi/onto/toimo/nationalities/Swiss', 'http://www.yso.fi/onto/koko/p7934']\n",
      "portugalilaiset ['http://seco.tkk.fi/saha3/ud33f4204-1c6d-40a1-a3ee-2a8158f56921', 'http://www.yso.fi/onto/koko/p52159']\n",
      "itävaltalaiset ['http://seco.tkk.fi/onto/toimo/nationalities/Austrian', 'http://www.yso.fi/onto/koko/p5291']\n",
      "skotit ['http://seco.tkk.fi/onto/toimo/nationalities/Scottish_Scots_', 'http://www.yso.fi/onto/koko/p16273']\n",
      "unkarilaiset ['http://seco.tkk.fi/onto/toimo/nationalities/Hungarian', 'http://www.yso.fi/onto/koko/p34461']\n",
      "ukrainalaiset ['http://seco.tkk.fi/onto/toimo/nationalities/Ukrainian', 'http://www.yso.fi/onto/koko/p9118']\n",
      "irakilaiset ['http://seco.tkk.fi/saha3/u84b75979-9611-4eac-96b9-fec1d03bf051', 'http://www.yso.fi/onto/koko/p69907']\n"
     ]
    }
   ],
   "source": [
    "# check which nationalities have multiple uris\n",
    "\n",
    "for k,v in natlabel_lookup.items():\n",
    "    if len(v)> 1:\n",
    "        print(k,sorted(v))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "72e3b18b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "sveitsiläiset ['http://seco.tkk.fi/onto/toimo/nationalities/Swiss', 'http://www.yso.fi/onto/koko/p7934']\n",
      "portugalilaiset ['http://seco.tkk.fi/saha3/ud33f4204-1c6d-40a1-a3ee-2a8158f56921', 'http://www.yso.fi/onto/koko/p52159']\n",
      "itävaltalaiset ['http://seco.tkk.fi/onto/toimo/nationalities/Austrian', 'http://www.yso.fi/onto/koko/p5291']\n",
      "skotit ['http://seco.tkk.fi/onto/toimo/nationalities/Scottish_Scots_', 'http://www.yso.fi/onto/koko/p16273']\n",
      "unkarilaiset ['http://seco.tkk.fi/onto/toimo/nationalities/Hungarian', 'http://www.yso.fi/onto/koko/p34461']\n",
      "ukrainalaiset ['http://seco.tkk.fi/onto/toimo/nationalities/Ukrainian', 'http://www.yso.fi/onto/koko/p9118']\n",
      "irakilaiset ['http://seco.tkk.fi/saha3/u84b75979-9611-4eac-96b9-fec1d03bf051', 'http://www.yso.fi/onto/koko/p69907']\n"
     ]
    }
   ],
   "source": [
    "# correct these to only use the the yso.fi/... codes\n",
    "g2=g\n",
    "\n",
    "allres=[]\n",
    "for k,v in natlabel_lookup.items():\n",
    "    if len(v)> 1:\n",
    "        print(k,sorted(v))\n",
    "        old= sorted(v)[0]\n",
    "        new=sorted(v)[1]\n",
    "        query=\"\"\"\n",
    "                 DELETE {?author rel:authorNationality <OLD> }\n",
    "                 INSERT { ?author rel:authorNationality  <NEW> }\n",
    "                 WHERE { ?author rel:authorNationality <OLD> }\n",
    "                 \"\"\"\n",
    "        q=query.replace(\"OLD\",old).replace(\"NEW\",new)\n",
    "        g2.update(q)\n",
    "        \n",
    "        qres = g2.query(\"\"\"\n",
    "\n",
    "        PREFIX rel: <http://ldf.fi/relse/> \n",
    "        PREFIX dct: <http://purl.org/dc/terms/>\n",
    "        PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "        PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "        PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "        PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "        PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "\n",
    "        SELECT ?s ?o WHERE { ?author rel:authorNationality ?s . ?s skos:prefLabel ?o. }\n",
    "\n",
    "        \"\"\")\n",
    "        allres+=qres\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "de0926db",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "new number of different nationalities: 145 \n",
      "old number of different nationalities: 152\n",
      "[('http://www.yso.fi/onto/koko/p13629', {'espanjalaiset'}), ('http://www.yso.fi/onto/koko/p2224', {'britit'}), ('http://www.yso.fi/onto/koko/p73101', {'yhdysvaltalaiset'}), ('http://www.yso.fi/onto/koko/p54872', {'kanadalaiset'}), ('http://www.yso.fi/onto/koko/p3437', {'ranskalaiset'}), ('http://www.yso.fi/onto/koko/p745', {'saksalaiset'}), ('http://www.yso.fi/onto/koko/p14632', {'alankomaalaiset'}), ('http://www.yso.fi/onto/koko/p6292', {'tanskalaiset'}), ('http://www.yso.fi/onto/koko/p607', {'englantilaiset'}), ('http://seco.tkk.fi/saha3/u996eb3eb-230f-4dc5-b607-8f06acbf66ad', {'libanonilaiset'})] [('http://seco.tkk.fi/saha3/uae9f2b4b-bf6b-4b38-afbe-8d92fa84372c', {'makedonialaiset'}), ('http://seco.tkk.fi/saha3/u4d0f8bfc-1dc4-4d8b-886f-8c4430553d48', {'jamaikalaiset'}), ('http://www.yso.fi/onto/koko/p3295', {'baltit'}), ('http://www.yso.fi/onto/koko/p35074', {'marit'}), ('http://seco.tkk.fi/saha3/ud472f914-dcc0-4ec3-9753-7815d6b15b93', {'norsunluurannikkolaiset'}), ('http://www.yso.fi/onto/koko/p34058', {'karjalaiset'}), ('http://www.yso.fi/onto/koko/p60528', {'Burundi'}), ('http://www.yso.fi/onto/koko/p16395', {'sorbit'}), ('http://seco.tkk.fi/saha3/uadf097fc-3813-4fff-aa30-01de69d746cd', {'kamerunilaiset'}), ('http://seco.tkk.fi/saha3/uea147f18-cc18-4eb9-baf1-6b2161b9bdc1', {'botswanalaiset'})]\n"
     ]
    }
   ],
   "source": [
    "# nationality label lookup 2\n",
    "\n",
    "qres = g2.query(\"\"\"\n",
    "#PREFIX kaunokki: <http://www.yso.fi/onto/kaunokki#> \n",
    "PREFIX rel: <http://ldf.fi/relse/> \n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX schema: <http://schema.org/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX xml: <http://www.w3.org/XML/1998/namespace>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT ?nationality (SAMPLE(?natlabel) AS ?natl)\n",
    "WHERE {\n",
    "  ?teos a rel:novel ; rel:hasAuthor ?author. \n",
    "  ?author rel:authorNationality ?nationality . ?nationality skos:prefLabel ?label.\n",
    "  FILTER (LANG(?label)=\"fi\")\n",
    "  ?nationality skos:prefLabel ?labelAny.\n",
    "  #BIND( \"unk\" as ?label2)\n",
    "  BIND(COALESCE(?label, ?labelAny) AS ?natlabel )\n",
    "} GROUP BY ?nationality\n",
    "\"\"\")\n",
    "\n",
    "nat_lookup2=defaultdict(set)\n",
    "for url, label in qres:\n",
    "    nat_lookup2[str(url)].update([str(label)])\n",
    "    \n",
    "\n",
    "print(\"new number of different nationalities:\",len(nat_lookup2),\"\\nold number of different nationalities:\", len(nat_lookup))\n",
    "print(list(nat_lookup2.items())[:10],list(nat_lookup2.items())[-10:])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "d6b5c58c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# double-check if some nationalities still have multiple uris\n",
    "for k,v in nat_lookup2.items():\n",
    "    if len(v)> 1:\n",
    "        print(k,sorted(v))\n",
    "        \n",
    "# none yay!"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "9f7ef929",
   "metadata": {},
   "outputs": [],
   "source": [
    "# natlabel lookup updated\n",
    "\n",
    "natlabel_lookup2=defaultdict(set)\n",
    "for url, label in qres:\n",
    "    natlabel_lookup2[str(label)].update([str(url)])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "ef525370",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['Burundi', 'Kroatia', 'Päiväntasaajan Guinea', 'Uusi-Seelanti', 'Venezuelan', 'Yhdysvallat', 'afganistanilaiset', 'ahvenanmaalaiset', 'alankomaalaiset', 'albaanit', 'algerialaiset', 'amerikankuubalaiset', 'amerikansuomalaiset', 'amerikkalaiset', 'angolalaiset', 'argentiinalaiset', 'armenialaiset', 'assyrialaiset', 'australialaiset', 'azerbaidžanilaiset', 'baltit', 'bangladeshiläiset', 'baskit', 'belgialainen', 'belgialaiset', 'bolivialaiset', 'bosniahertsegovinalaiset', 'botswanalaiset', 'brasilialaiset', 'britit', 'bulgarialaiset', 'chileläiset', 'dominikaanilaiset', 'egyptiläiset', 'englannin kieli', 'englantilaiset', 'espanjalaiset', 'eteläafrikkalaiset', 'eteläamerikkalaiset', 'etiopialaiset', 'flaamit', 'färingit', 'georgialaiset', 'ghanalaiset', 'grönlantilaiset', 'guadeloupelaiset', 'guatemalalaiset', 'haitilaiset', 'hantit', 'hollannin kieli', 'indonesialaiset', 'inkeriläiset', 'intialaiset', 'irakilaiset', 'irakilaiset', 'iranilaiset', 'irlantilaiset', 'islantilaiset', 'israelilaiset', 'italialaiset', 'itävaltalaiset', 'itävaltalaiset', 'jamaikalaiset', 'japanilaiset', 'jugoslavialaiset', 'jännityskirjallisuus', 'kamerunilaiset', 'kanadalaiset', 'karibialaiset', 'karjalaiset', 'katalaanit', 'kazakstanilaiset', 'kenialaiset', 'kiinalaiset', 'kirgiisit', 'kolumbialaiset', 'kongolaiset', 'korealaiset', 'kreikkalaiset', 'kroaatit', 'kurdit', 'kuubalaiset', 'latvialaiset', 'libanonilaiset', 'libyalaiset', 'liettualaiset', 'luxemburgilaiset', 'makedonialaiset', 'malesialaiset', 'mansit', 'marit', 'marokkolaiset', 'mauritiuslaiset', 'meksikolaiset', 'moldovalaiset', 'mosambikilaiset', 'neuvostoliittolaiset', 'nicaragualaiset', 'nigerialaiset', 'norjalaiset', 'norsunluurannikkolaiset', 'pakistanilaiset', 'palestiinalaiset', 'persialaiset', 'perulaiset', 'pohjoisirlantilaiset', 'portugalilaiset', 'portugalilaiset', 'puolalaiset', 'ranskalaiset', 'rhodesialaiset', 'romanialaiset', 'roomalaiset', 'ruotsalaiset', 'ruotsinsuomalaiset', 'saamelaiset', 'saksalaiset', 'saudiarabialaiset', 'senegalilaiset', 'serbit', 'singaporelaiset', 'skotit', 'skotit', 'slovakit', 'sloveenit', 'somalit', 'sorbit', 'sotilaat', 'suomalaiset', 'sveitsiläiset', 'sveitsiläiset', 'syyrialaiset', 'tanskalaiset', 'toimittajat', 'turkkilaiset', 'tšekkiläiset', 'ugandalaiset', 'ukrainalaiset', 'ukrainalaiset', 'unkarilaiset', 'unkarilaiset', 'uruguaylaiset', 'uusiseelantilaiset', 'valkovenäläiset', 'venezuelalaiset', 'venäläiset', 'vietnamilaiset', 'virolaiset', 'vironvenäläiset', 'walesilaiset', 'yhdysvaltalaiset', 'zimbabwelaiset']\n"
     ]
    }
   ],
   "source": [
    "# print out all nationalities and examine their validity\n",
    "\n",
    "alist=[]\n",
    "for n in nat_lookup.values():\n",
    "    alist += list(n)\n",
    "print(sorted(alist))\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "f4552bef",
   "metadata": {},
   "outputs": [],
   "source": [
    "# do the following manual corrections\n",
    "\n",
    "# remove: toimittajat, sotilaat, jännityskirjallisuus\n",
    "\n",
    "# update:\n",
    "# amerikkalaiset = yhdysvaltalaiset\n",
    "# yhdysvallat = yhdysvaltalaiset\n",
    "# Uusi-Seelant = uusiseelantilaiset\n",
    "# belgialainen = belgialaiset\n",
    "# hollannin kieli = alankomaalaiset\n",
    "# englannin kieli = britit\n",
    "\n",
    "\n",
    "\n",
    "mylist= [(\"amerikkalaiset\",\"yhdysvaltalaiset\"),(\"englantilaiset\",\"britit\"), (\"Yhdysvallat\",\"yhdysvaltalaiset\"),\n",
    "         (\"Uusi-Seelanti\",\"uusiseelantilaiset\"), (\"belgialainen\",\"belgialaiset\"),(\"hollannin kieli\",\"alankomaalaiset\"),\n",
    "         (\"englannin kieli\",\"britit\"),(\"Kroatia\",\"kroaatit\"),(\"skotit\",\"britit\"),(\"walesilaiset\",\"britit\")]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "45cf7dd2",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "amerikkalaiset ['http://www.yso.fi/onto/koko/p15010'] yhdysvaltalaiset ['http://www.yso.fi/onto/koko/p73101']\n",
      "englantilaiset ['http://www.yso.fi/onto/koko/p607'] britit ['http://www.yso.fi/onto/koko/p2224']\n",
      "Yhdysvallat ['http://www.yso.fi/onto/koko/p63178'] yhdysvaltalaiset ['http://www.yso.fi/onto/koko/p73101']\n",
      "Uusi-Seelanti ['http://www.yso.fi/onto/koko/p57497'] uusiseelantilaiset ['http://seco.tkk.fi/saha3/u30d7a0cf-b7d3-439c-9cbb-47fede6352fd']\n",
      "belgialainen ['http://seco.tkk.fi/onto/toimo/nationalities/Belgian'] belgialaiset ['http://www.yso.fi/onto/koko/p7333']\n",
      "hollannin kieli ['http://www.yso.fi/onto/koko/p13543'] alankomaalaiset ['http://www.yso.fi/onto/koko/p14632']\n",
      "englannin kieli ['http://www.yso.fi/onto/koko/p15528'] britit ['http://www.yso.fi/onto/koko/p2224']\n",
      "Kroatia ['http://www.yso.fi/onto/koko/p61314'] kroaatit ['http://www.yso.fi/onto/koko/p2100']\n",
      "skotit ['http://www.yso.fi/onto/koko/p16273'] britit ['http://www.yso.fi/onto/koko/p2224']\n",
      "walesilaiset ['http://seco.tkk.fi/saha3/u47895875-438a-47bb-9565-aec890451cb8'] britit ['http://www.yso.fi/onto/koko/p2224']\n"
     ]
    }
   ],
   "source": [
    "# update based on mylist\n",
    "\n",
    "for o,n in mylist:\n",
    "    old=list(natlabel_lookup2[o])\n",
    "    new=list(natlabel_lookup2[n])\n",
    "    print(o, old, n, new)\n",
    "    query=\"\"\"\n",
    "                 DELETE {?author rel:authorNationality <OLD> }\n",
    "                 INSERT { ?author rel:authorNationality  <NEW> }\n",
    "                 WHERE { ?author rel:authorNationality <OLD> }\n",
    "                 \"\"\"\n",
    "    q=query.replace(\"OLD\",old[0]).replace(\"NEW\",new[0])\n",
    "    g2.update(q)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "10c4491b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "['http://www.yso.fi/onto/koko/p35181']\n",
      "['http://www.yso.fi/onto/koko/p31721']\n",
      "['http://www.yso.fi/onto/koko/p1750']\n"
     ]
    }
   ],
   "source": [
    "# delete no-nationalities\n",
    "\n",
    "for v in [\"toimittajat\",\"sotilaat\",\"jännityskirjallisuus\"]:\n",
    "    old=list(natlabel_lookup[v])\n",
    "    #new=list(natlabel_lookup[n])\n",
    "    print(old)\n",
    "    query=\"\"\"\n",
    "                 DELETE {?author rel:authorNationality <OLD> }\n",
    "                 #INSERT { ?author rel:authorNationality  <NEW> }\n",
    "                 WHERE { ?author rel:authorNationality <OLD> }\n",
    "                 \"\"\"\n",
    "    q=query.replace(\"OLD\",old[0])#.replace(\"NEW\",new[0])\n",
    "    g2.update(q)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "e90be531",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "24963\n",
      "[('http://www.btj.fi/at_1678175', {'http://www.yso.fi/onto/koko/p13629'}), ('http://data.kirjasampo.fi/abstractWork_9789518830927', {'http://www.yso.fi/onto/koko/p2224'}), ('http://www.yso.fi/onto/kaunokki#ateos_9589', {'http://www.yso.fi/onto/koko/p73101'}), ('http://www.yso.fi/onto/kaunokki#ateos_3912', {'http://www.yso.fi/onto/koko/p73101'}), ('http://data.kirjasampo.fi/abstractWork_6834230', {'http://www.yso.fi/onto/koko/p73101'}), ('http://www.yso.fi/onto/kaunokki#ateos_2216', {'http://www.yso.fi/onto/koko/p73101'}), ('http://data.kirjasampo.fi/abstractWork_9789511255659', {'http://www.yso.fi/onto/koko/p73101'}), ('http://seco.tkk.fi/saha3/ue552c4bb-ecd8-495d-be5d-00c45f9caaa8', {'http://www.yso.fi/onto/koko/p73101'}), ('http://seco.tkk.fi/saha3/ucf938d75-fc5e-4637-9715-73092ba5482a', {'http://www.yso.fi/onto/koko/p54872'}), ('http://seco.tkk.fi/saha3/u99617114-2455-49e4-8bed-05851eb04a3f', {'http://www.yso.fi/onto/koko/p3437'})] [('http://www.yso.fi/onto/kaunokki#ateos_7919', 'unk'), ('http://www.yso.fi/onto/kaunokki#ateos_12091', 'unk'), ('http://seco.tkk.fi/saha3/u01fdc545-2ad2-4870-ba54-e9c7177a7262', 'unk'), ('http://www.yso.fi/onto/kaunokki#ateos_12919', 'unk'), ('http://www.yso.fi/onto/kaunokki#ateos_12708', 'unk'), ('http://www.yso.fi/onto/kaunokki#ateos_7440', 'unk'), ('http://www.yso.fi/onto/kaunokki#ateos_6533', 'unk'), ('http://data.kirjasampo.fi/abstractWork_4291711', 'unk'), ('http://seco.tkk.fi/saha3/u9f32cd96-7cf8-46bd-8800-c9c647fc03b8', 'unk'), ('http://seco.tkk.fi/saha3/u6f441d8b-1b5a-4ae9-ae50-dfd8edaa0295', 'unk')]\n"
     ]
    }
   ],
   "source": [
    "# update lookup\n",
    "\n",
    "qres = g2.query(\"\"\"\n",
    "#PREFIX kaunokki: <http://www.yso.fi/onto/kaunokki#> \n",
    "PREFIX rel: <http://ldf.fi/relse/> \n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX schema: <http://schema.org/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX xml: <http://www.w3.org/XML/1998/namespace>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT ?teos ?nationality\n",
    "WHERE {\n",
    "  ?teos a rel:novel ; rel:hasAuthor ?author. \n",
    "  ?author rel:authorNationality ?nationality .# ?nationality skos:prefLabel ?label.\n",
    "  #FILTER (LANG(?label)=\"fi\")\n",
    "}  \"\"\")\n",
    "\n",
    "#novelnat_lookup=dict([(str(url), str(label)) for url, label in qres])\n",
    "#print(list(gender_lookup.items())[-10:])\n",
    "import collections \n",
    "\n",
    "novelnat=defaultdict(set)\n",
    "for url, label in qres:\n",
    "    novelnat[str(url)].update([str(label)])\n",
    "    \n",
    "novelnat_lookup2 = {novel:\"unk\" for novel in novels if novel not in novelnat.keys() }\n",
    "novelnat.update(novelnat_lookup2)\n",
    "print(len(novelnat))\n",
    "print(list(novelnat.items())[:10],list(novelnat_lookup2.items())[-10:])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "73a8b513",
   "metadata": {},
   "outputs": [],
   "source": [
    "# count novels per nationality\n",
    "countdict=defaultdict(int)\n",
    "\n",
    "for k,v in novelnat.items():\n",
    "    if v == \"unk\":\n",
    "        countdict[v] +=1\n",
    "    else:\n",
    "        for val in v:\n",
    "            label=list(nat_lookup[val])\n",
    "            #print(label)\n",
    "            if len(label) ==1:\n",
    "                countdict[label[0]] += 1\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "1676c644",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>0</th>\n",
       "      <th>1</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>yhdysvaltalaiset</td>\n",
       "      <td>6993</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>britit</td>\n",
       "      <td>5664</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>ruotsalaiset</td>\n",
       "      <td>2840</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>132</th>\n",
       "      <td>unk</td>\n",
       "      <td>1414</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ranskalaiset</td>\n",
       "      <td>1166</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>saksalaiset</td>\n",
       "      <td>1088</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>norjalaiset</td>\n",
       "      <td>844</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>suomalaiset</td>\n",
       "      <td>744</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>venäläiset</td>\n",
       "      <td>569</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>tanskalaiset</td>\n",
       "      <td>532</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>kanadalaiset</td>\n",
       "      <td>456</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>irlantilaiset</td>\n",
       "      <td>338</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>australialaiset</td>\n",
       "      <td>310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>itävaltalaiset</td>\n",
       "      <td>285</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>italialaiset</td>\n",
       "      <td>259</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>espanjalaiset</td>\n",
       "      <td>166</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>unkarilaiset</td>\n",
       "      <td>155</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>alankomaalaiset</td>\n",
       "      <td>149</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>virolaiset</td>\n",
       "      <td>146</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>belgialaiset</td>\n",
       "      <td>134</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>sveitsiläiset</td>\n",
       "      <td>127</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>puolalaiset</td>\n",
       "      <td>119</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>islantilaiset</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>kiinalaiset</td>\n",
       "      <td>95</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>eteläafrikkalaiset</td>\n",
       "      <td>94</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>japanilaiset</td>\n",
       "      <td>79</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>tšekkiläiset</td>\n",
       "      <td>63</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>ruotsinsuomalaiset</td>\n",
       "      <td>52</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>brasilialaiset</td>\n",
       "      <td>51</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>intialaiset</td>\n",
       "      <td>50</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                      0     1\n",
       "2      yhdysvaltalaiset  6993\n",
       "1                britit  5664\n",
       "9          ruotsalaiset  2840\n",
       "132                 unk  1414\n",
       "4          ranskalaiset  1166\n",
       "5           saksalaiset  1088\n",
       "13          norjalaiset   844\n",
       "10          suomalaiset   744\n",
       "15           venäläiset   569\n",
       "7          tanskalaiset   532\n",
       "3          kanadalaiset   456\n",
       "19        irlantilaiset   338\n",
       "25      australialaiset   310\n",
       "34       itävaltalaiset   285\n",
       "11         italialaiset   259\n",
       "0         espanjalaiset   166\n",
       "43         unkarilaiset   155\n",
       "6       alankomaalaiset   149\n",
       "27           virolaiset   146\n",
       "29         belgialaiset   134\n",
       "14        sveitsiläiset   127\n",
       "35          puolalaiset   119\n",
       "23        islantilaiset   100\n",
       "24          kiinalaiset    95\n",
       "16   eteläafrikkalaiset    94\n",
       "17         japanilaiset    79\n",
       "36         tšekkiläiset    63\n",
       "50   ruotsinsuomalaiset    52\n",
       "28       brasilialaiset    51\n",
       "46          intialaiset    50"
      ]
     },
     "execution_count": 47,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# count per nationality\n",
    "pd.DataFrame(countdict.items()).sort_values(by=1,ascending=False).head(30)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "11e51ceb",
   "metadata": {},
   "outputs": [],
   "source": [
    "# count how many works we have to compare with the earlier version\n",
    "\n",
    "Q_kans =\"\"\"\n",
    "PREFIX rel: <http://ldf.fi/relse/> \n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX schema: <http://schema.org/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX xml: <http://www.w3.org/XML/1998/namespace>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT DISTINCT ?kansallisuus (SAMPLE(?klabel) AS ?label) (COUNT(DISTINCT ?author) as ?authorcount) WHERE {\n",
    "  \n",
    "  ?teos  a rel:novel ; rel:hasAuthor ?author .\n",
    "  #?teos kaunokki:manifests_in ?julkaisu .\n",
    "  ?teos rel:pubYear ?vuosi . #?vuosi skos:prefLabel ?vuosiluku .\n",
    "  BIND(regex(str(?vuosi), \"199\" ) AS ?decade)\n",
    "  FILTER(?decade = xsd:boolean(\"true\"))\n",
    "  ?author rel:authorNationality ?kansallisuus . OPTIONAL { ?kansallisuus skos:prefLabel ?klabel FILTER(LANG(?klabel)=\"fi\") }\n",
    "  } GROUP BY ?kansallisuus\n",
    "ORDER BY DESC(xsd:integer(?authorcount))\n",
    "\"\"\"\n",
    "\n",
    "decades=[190,191,192,193,194,195,196,197,198,199,200,201]\n",
    "\n",
    "qres = g2.query(Q_kans)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "29eddeab",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "190\n",
      "191\n",
      "192\n",
      "193\n",
      "194\n",
      "195\n",
      "196\n",
      "197\n",
      "198\n",
      "199\n",
      "200\n",
      "201\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nationality</th>\n",
       "      <th>nlabel</th>\n",
       "      <th>authors</th>\n",
       "      <th>decade</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p745</td>\n",
       "      <td>saksalaiset</td>\n",
       "      <td>36</td>\n",
       "      <td>1900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p2224</td>\n",
       "      <td>britit</td>\n",
       "      <td>22</td>\n",
       "      <td>1900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p16897</td>\n",
       "      <td>ruotsalaiset</td>\n",
       "      <td>21</td>\n",
       "      <td>1900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p3437</td>\n",
       "      <td>ranskalaiset</td>\n",
       "      <td>19</td>\n",
       "      <td>1900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p73101</td>\n",
       "      <td>yhdysvaltalaiset</td>\n",
       "      <td>14</td>\n",
       "      <td>1900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p60528</td>\n",
       "      <td>Burundi</td>\n",
       "      <td>1</td>\n",
       "      <td>2010</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p53709</td>\n",
       "      <td>perulaiset</td>\n",
       "      <td>1</td>\n",
       "      <td>2010</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://seco.tkk.fi/saha3/ua57be8b1-e990-4896-b...</td>\n",
       "      <td>bosniahertsegovinalaiset</td>\n",
       "      <td>1</td>\n",
       "      <td>2010</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://seco.tkk.fi/saha3/ubac7413a-895d-41a5-b...</td>\n",
       "      <td>venezuelalaiset</td>\n",
       "      <td>1</td>\n",
       "      <td>2010</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://seco.tkk.fi/saha3/uadf097fc-3813-4fff-a...</td>\n",
       "      <td>kamerunilaiset</td>\n",
       "      <td>1</td>\n",
       "      <td>2010</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>606 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                          nationality  \\\n",
       "0                    http://www.yso.fi/onto/koko/p745   \n",
       "0                   http://www.yso.fi/onto/koko/p2224   \n",
       "0                  http://www.yso.fi/onto/koko/p16897   \n",
       "0                   http://www.yso.fi/onto/koko/p3437   \n",
       "0                  http://www.yso.fi/onto/koko/p73101   \n",
       "..                                                ...   \n",
       "0                  http://www.yso.fi/onto/koko/p60528   \n",
       "0                  http://www.yso.fi/onto/koko/p53709   \n",
       "0   http://seco.tkk.fi/saha3/ua57be8b1-e990-4896-b...   \n",
       "0   http://seco.tkk.fi/saha3/ubac7413a-895d-41a5-b...   \n",
       "0   http://seco.tkk.fi/saha3/uadf097fc-3813-4fff-a...   \n",
       "\n",
       "                      nlabel authors  decade  \n",
       "0                saksalaiset      36    1900  \n",
       "0                     britit      22    1900  \n",
       "0               ruotsalaiset      21    1900  \n",
       "0               ranskalaiset      19    1900  \n",
       "0           yhdysvaltalaiset      14    1900  \n",
       "..                       ...     ...     ...  \n",
       "0                    Burundi       1    2010  \n",
       "0                 perulaiset       1    2010  \n",
       "0   bosniahertsegovinalaiset       1    2010  \n",
       "0            venezuelalaiset       1    2010  \n",
       "0             kamerunilaiset       1    2010  \n",
       "\n",
       "[606 rows x 4 columns]"
      ]
     },
     "execution_count": 49,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_kans=pd.DataFrame()\n",
    "for d in decades:\n",
    "    print(d)\n",
    "    #sparql = SPARQLWrapper(\"http://ldf.fi/kirjasampo/sparql\")\n",
    "    q=Q_kans.replace(\"199\",str(d))\n",
    "    qres = g2.query(q)\n",
    "    for row in qres:\n",
    "        nat = str(row.asdict()['kansallisuus'].toPython())   \n",
    "        natname = str(row.asdict()['label'].toPython())   \n",
    "        a = str(row.asdict()['authorcount'].toPython()) \n",
    "        temp=pd.DataFrame({\"nationality\":nat,\"nlabel\":natname,\"authors\":a}.values() ).T.rename({0:\"nationality\",1:\"nlabel\",2:\"authors\"},axis=1)\n",
    "        temp[\"decade\"] = d*10\n",
    "        df_kans=pd.concat([df_kans,temp])\n",
    "df_kans"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "id": "88552531",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nationality</th>\n",
       "      <th>nlabel</th>\n",
       "      <th>authors</th>\n",
       "      <th>decade</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p73101</td>\n",
       "      <td>yhdysvaltalaiset</td>\n",
       "      <td>14</td>\n",
       "      <td>1900</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p73101</td>\n",
       "      <td>yhdysvaltalaiset</td>\n",
       "      <td>26</td>\n",
       "      <td>1910</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p73101</td>\n",
       "      <td>yhdysvaltalaiset</td>\n",
       "      <td>44</td>\n",
       "      <td>1920</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p73101</td>\n",
       "      <td>yhdysvaltalaiset</td>\n",
       "      <td>39</td>\n",
       "      <td>1930</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p73101</td>\n",
       "      <td>yhdysvaltalaiset</td>\n",
       "      <td>106</td>\n",
       "      <td>1940</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p73101</td>\n",
       "      <td>yhdysvaltalaiset</td>\n",
       "      <td>144</td>\n",
       "      <td>1950</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p73101</td>\n",
       "      <td>yhdysvaltalaiset</td>\n",
       "      <td>235</td>\n",
       "      <td>1960</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p73101</td>\n",
       "      <td>yhdysvaltalaiset</td>\n",
       "      <td>282</td>\n",
       "      <td>1970</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p73101</td>\n",
       "      <td>yhdysvaltalaiset</td>\n",
       "      <td>436</td>\n",
       "      <td>1980</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p73101</td>\n",
       "      <td>yhdysvaltalaiset</td>\n",
       "      <td>502</td>\n",
       "      <td>1990</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p73101</td>\n",
       "      <td>yhdysvaltalaiset</td>\n",
       "      <td>532</td>\n",
       "      <td>2000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p73101</td>\n",
       "      <td>yhdysvaltalaiset</td>\n",
       "      <td>593</td>\n",
       "      <td>2010</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                          nationality            nlabel authors  decade\n",
       "0  http://www.yso.fi/onto/koko/p73101  yhdysvaltalaiset      14    1900\n",
       "0  http://www.yso.fi/onto/koko/p73101  yhdysvaltalaiset      26    1910\n",
       "0  http://www.yso.fi/onto/koko/p73101  yhdysvaltalaiset      44    1920\n",
       "0  http://www.yso.fi/onto/koko/p73101  yhdysvaltalaiset      39    1930\n",
       "0  http://www.yso.fi/onto/koko/p73101  yhdysvaltalaiset     106    1940\n",
       "0  http://www.yso.fi/onto/koko/p73101  yhdysvaltalaiset     144    1950\n",
       "0  http://www.yso.fi/onto/koko/p73101  yhdysvaltalaiset     235    1960\n",
       "0  http://www.yso.fi/onto/koko/p73101  yhdysvaltalaiset     282    1970\n",
       "0  http://www.yso.fi/onto/koko/p73101  yhdysvaltalaiset     436    1980\n",
       "0  http://www.yso.fi/onto/koko/p73101  yhdysvaltalaiset     502    1990\n",
       "0  http://www.yso.fi/onto/koko/p73101  yhdysvaltalaiset     532    2000\n",
       "0  http://www.yso.fi/onto/koko/p73101  yhdysvaltalaiset     593    2010"
      ]
     },
     "execution_count": 50,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# for example, see how many American authors:\n",
    "df_kans[df_kans[\"nlabel\"]==\"yhdysvaltalaiset\"].sort_values(by=\"nlabel\").head(30)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "805b70f4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'http://www.yso.fi/onto/koko/p9135'}"
      ]
     },
     "execution_count": 51,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "natlabel_lookup[\"australialaiset\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "id": "c817db91",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>authors</th>\n",
       "      <th>decade</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>999</td>\n",
       "      <td>1970</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1283</td>\n",
       "      <td>1980</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1316</td>\n",
       "      <td>1990</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1700</td>\n",
       "      <td>2000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1990</td>\n",
       "      <td>2010</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  authors  decade\n",
       "0     999    1970\n",
       "0    1283    1980\n",
       "0    1316    1990\n",
       "0    1700    2000\n",
       "0    1990    2010"
      ]
     },
     "execution_count": 52,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# sum of authors per decade\n",
    "Q_dec =\"\"\"\n",
    "PREFIX rel: <http://ldf.fi/relse/> \n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX schema: <http://schema.org/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX xml: <http://www.w3.org/XML/1998/namespace>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT  (COUNT(DISTINCT ?author) as ?authorcount) WHERE {\n",
    "  \n",
    "  ?teos  a rel:novel ; rel:hasAuthor ?author .\n",
    "  #?teos kaunokki:manifests_in ?julkaisu .\n",
    "  ?teos rel:pubYear ?vuosi . #?vuosi skos:prefLabel ?vuosiluku .\n",
    "  BIND(regex(str(?vuosi), \"199\" ) AS ?decade)\n",
    "  FILTER(?decade = xsd:boolean(\"true\"))\n",
    "  ?author rel:authorNationality ?kansallisuus . OPTIONAL { ?kansallisuus skos:prefLabel ?klabel FILTER(LANG(?klabel)=\"fi\") }\n",
    "  } #GROUP BY ?kansallisuus\n",
    "ORDER BY DESC(xsd:integer(?authorcount))\n",
    "\"\"\"\n",
    "\n",
    "decades=[197,198,199,200,201]\n",
    "\n",
    "df_dec=pd.DataFrame()\n",
    "for d in decades:\n",
    "    #print(d)\n",
    "    #sparql = SPARQLWrapper(\"http://ldf.fi/kirjasampo/sparql\")\n",
    "    q=Q_dec.replace(\"199\",str(d))\n",
    "    qres = g2.query(q)\n",
    "    for row in qres:\n",
    "        #nat = str(row.asdict()['kansallisuus'].toPython())   \n",
    "        #natname = str(row.asdict()['label'].toPython())   \n",
    "        a = str(row.asdict()['authorcount'].toPython()) \n",
    "        temp=pd.DataFrame({\"authors\":a}.values() ).T.rename({0:\"authors\"},axis=1)\n",
    "        temp[\"decade\"] = d*10\n",
    "        df_dec=pd.concat([df_dec,temp])\n",
    "df_dec"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "id": "dd4565c0",
   "metadata": {},
   "outputs": [],
   "source": [
    "# total per nationality and gender\n",
    "\n",
    "Q_kans =\"\"\"\n",
    "PREFIX rel: <http://ldf.fi/relse/> \n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX schema: <http://schema.org/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX xml: <http://www.w3.org/XML/1998/namespace>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT DISTINCT ?kansallisuus ?genderinfo (SAMPLE(?klabel) AS ?label) (COUNT(DISTINCT ?author) as ?authorcount) WHERE {\n",
    "  \n",
    "  ?teos  a rel:novel ; rel:hasAuthor ?author ; rel:pubYear ?year .\n",
    "  FILTER(?year > 1949)\n",
    "  ?author rel:authorNationality ?kansallisuus . ?kansallisuus skos:prefLabel ?klabel FILTER(LANG(?klabel)=\"fi\") .\n",
    "  \n",
    "  OPTIONAL { ?author foaf:gender ?gender }\n",
    "  BIND(\"unk\" as ?gender2)\n",
    "  BIND(COALESCE(?gender, ?gender2) AS ?genderinfo)\n",
    "  } GROUP BY ?kansallisuus ?genderinfo\n",
    "ORDER BY DESC(xsd:integer(?authorcount))\n",
    "\"\"\"\n",
    "\n",
    "decades=[197,198,199,200,201]\n",
    "\n",
    "qres = g2.query(Q_kans)\n",
    "df_authors=pd.DataFrame()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "id": "88086a64",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nationality</th>\n",
       "      <th>nlabel</th>\n",
       "      <th>authors</th>\n",
       "      <th>gender</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p73101</td>\n",
       "      <td>yhdysvaltalaiset</td>\n",
       "      <td>1048</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#male</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p73101</td>\n",
       "      <td>yhdysvaltalaiset</td>\n",
       "      <td>923</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#female</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p2224</td>\n",
       "      <td>britit</td>\n",
       "      <td>728</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#male</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p2224</td>\n",
       "      <td>britit</td>\n",
       "      <td>610</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#female</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p16897</td>\n",
       "      <td>ruotsalaiset</td>\n",
       "      <td>307</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#female</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p16897</td>\n",
       "      <td>ruotsalaiset</td>\n",
       "      <td>274</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#male</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p3437</td>\n",
       "      <td>ranskalaiset</td>\n",
       "      <td>268</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#male</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p745</td>\n",
       "      <td>saksalaiset</td>\n",
       "      <td>207</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#male</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p8327</td>\n",
       "      <td>venäläiset</td>\n",
       "      <td>164</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#male</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p745</td>\n",
       "      <td>saksalaiset</td>\n",
       "      <td>135</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#female</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p3437</td>\n",
       "      <td>ranskalaiset</td>\n",
       "      <td>120</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#female</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p35259</td>\n",
       "      <td>suomalaiset</td>\n",
       "      <td>106</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#female</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p3113</td>\n",
       "      <td>norjalaiset</td>\n",
       "      <td>102</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#male</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p35259</td>\n",
       "      <td>suomalaiset</td>\n",
       "      <td>101</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#male</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p54872</td>\n",
       "      <td>kanadalaiset</td>\n",
       "      <td>90</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#female</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p6292</td>\n",
       "      <td>tanskalaiset</td>\n",
       "      <td>88</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#male</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p12201</td>\n",
       "      <td>italialaiset</td>\n",
       "      <td>85</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#male</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p9135</td>\n",
       "      <td>australialaiset</td>\n",
       "      <td>67</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#female</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p3113</td>\n",
       "      <td>norjalaiset</td>\n",
       "      <td>63</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#female</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p13629</td>\n",
       "      <td>espanjalaiset</td>\n",
       "      <td>62</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#male</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                          nationality            nlabel  authors  \\\n",
       "0  http://www.yso.fi/onto/koko/p73101  yhdysvaltalaiset     1048   \n",
       "0  http://www.yso.fi/onto/koko/p73101  yhdysvaltalaiset      923   \n",
       "0   http://www.yso.fi/onto/koko/p2224            britit      728   \n",
       "0   http://www.yso.fi/onto/koko/p2224            britit      610   \n",
       "0  http://www.yso.fi/onto/koko/p16897      ruotsalaiset      307   \n",
       "0  http://www.yso.fi/onto/koko/p16897      ruotsalaiset      274   \n",
       "0   http://www.yso.fi/onto/koko/p3437      ranskalaiset      268   \n",
       "0    http://www.yso.fi/onto/koko/p745       saksalaiset      207   \n",
       "0   http://www.yso.fi/onto/koko/p8327        venäläiset      164   \n",
       "0    http://www.yso.fi/onto/koko/p745       saksalaiset      135   \n",
       "0   http://www.yso.fi/onto/koko/p3437      ranskalaiset      120   \n",
       "0  http://www.yso.fi/onto/koko/p35259       suomalaiset      106   \n",
       "0   http://www.yso.fi/onto/koko/p3113       norjalaiset      102   \n",
       "0  http://www.yso.fi/onto/koko/p35259       suomalaiset      101   \n",
       "0  http://www.yso.fi/onto/koko/p54872      kanadalaiset       90   \n",
       "0   http://www.yso.fi/onto/koko/p6292      tanskalaiset       88   \n",
       "0  http://www.yso.fi/onto/koko/p12201      italialaiset       85   \n",
       "0   http://www.yso.fi/onto/koko/p9135   australialaiset       67   \n",
       "0   http://www.yso.fi/onto/koko/p3113       norjalaiset       63   \n",
       "0  http://www.yso.fi/onto/koko/p13629     espanjalaiset       62   \n",
       "\n",
       "                                   gender  \n",
       "0    http://www.yso.fi/onto/kaunokki#male  \n",
       "0  http://www.yso.fi/onto/kaunokki#female  \n",
       "0    http://www.yso.fi/onto/kaunokki#male  \n",
       "0  http://www.yso.fi/onto/kaunokki#female  \n",
       "0  http://www.yso.fi/onto/kaunokki#female  \n",
       "0    http://www.yso.fi/onto/kaunokki#male  \n",
       "0    http://www.yso.fi/onto/kaunokki#male  \n",
       "0    http://www.yso.fi/onto/kaunokki#male  \n",
       "0    http://www.yso.fi/onto/kaunokki#male  \n",
       "0  http://www.yso.fi/onto/kaunokki#female  \n",
       "0  http://www.yso.fi/onto/kaunokki#female  \n",
       "0  http://www.yso.fi/onto/kaunokki#female  \n",
       "0    http://www.yso.fi/onto/kaunokki#male  \n",
       "0    http://www.yso.fi/onto/kaunokki#male  \n",
       "0  http://www.yso.fi/onto/kaunokki#female  \n",
       "0    http://www.yso.fi/onto/kaunokki#male  \n",
       "0    http://www.yso.fi/onto/kaunokki#male  \n",
       "0  http://www.yso.fi/onto/kaunokki#female  \n",
       "0  http://www.yso.fi/onto/kaunokki#female  \n",
       "0    http://www.yso.fi/onto/kaunokki#male  "
      ]
     },
     "execution_count": 54,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# for a check, compare authors in my graph and the original SW\n",
    "for row in qres:\n",
    "    nat = str(row.asdict()['kansallisuus'].toPython())   \n",
    "    natname = str(row.asdict()['label'].toPython())   \n",
    "    a = str(row.asdict()['authorcount'].toPython()) \n",
    "    ge = str(row.asdict()['genderinfo'].toPython()) \n",
    "    temp=pd.DataFrame({\"nationality\":nat,\"nlabel\":natname,\"authors\":a,\"gender\":ge}.values() ).T.rename({0:\"nationality\",1:\"nlabel\",2:\"authors\",3:\"gender\"},axis=1)\n",
    "    #temp[\"decade\"] = d*10\n",
    "    df_authors=pd.concat([df_authors,temp])\n",
    "df_authors[\"authors\"]=pd.to_numeric(df_authors[\"authors\"])\n",
    "df_authors.sort_values(by=\"authors\", ascending=False).head(20)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "id": "112382c0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>nationality</th>\n",
       "      <th>nlabel</th>\n",
       "      <th>authors</th>\n",
       "      <th>gender</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p2224</td>\n",
       "      <td>britit</td>\n",
       "      <td>728</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#male</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p2224</td>\n",
       "      <td>britit</td>\n",
       "      <td>610</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#female</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>http://www.yso.fi/onto/koko/p2224</td>\n",
       "      <td>britit</td>\n",
       "      <td>12</td>\n",
       "      <td>unk</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                         nationality  nlabel  authors  \\\n",
       "0  http://www.yso.fi/onto/koko/p2224  britit      728   \n",
       "0  http://www.yso.fi/onto/koko/p2224  britit      610   \n",
       "0  http://www.yso.fi/onto/koko/p2224  britit       12   \n",
       "\n",
       "                                   gender  \n",
       "0    http://www.yso.fi/onto/kaunokki#male  \n",
       "0  http://www.yso.fi/onto/kaunokki#female  \n",
       "0                                     unk  "
      ]
     },
     "execution_count": 56,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# e.g. df Brits\n",
    "df_authors[df_authors[\"nlabel\"]==\"britit\"].sort_values(by=\"authors\", ascending=False)#.tail(20)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "id": "f36c8a4a",
   "metadata": {},
   "outputs": [],
   "source": [
    "# SPARQL query the Booksampo SW\n",
    "\n",
    "HC=\"\"\"\n",
    "SELECT  (COUNT(DISTINCT ?author) as ?authorcount) (GROUP_CONCAT(?author; separator=\";\") AS ?authorUris) WHERE {\n",
    "  \n",
    "  ?teos  a kaunokki:romaani ; kaunokki:tekija ?author ; skos:prefLabel ?title.\n",
    "  ?teos kaunokki:alkukieli ?kieliuri .\n",
    "  FILTER (?kieliuri !=  <http://lexvo.org/id/iso639-3/fin>  )\n",
    "  ?teos kaunokki:manifests_in ?julkaisu .\n",
    "  ?julkaisu kaunokki:kieli <http://lexvo.org/id/iso639-3/fin> . # käännetty suomeksi\n",
    "  ?julkaisu kaunokki:ilmestymisvuosi ?vuosi . ?vuosi skos:prefLabel ?vuosiluku .\n",
    "  #BIND(regex(str(?vuosiluku), \"197\" ) AS ?decade)\n",
    "  \n",
    "  #FILTER(?decade = xsd:boolean(\"true\"))\n",
    "  FILTER(xsd:integer(?vuosiluku) > 1949)\n",
    "  \n",
    "  ?author kaunokki:kansallisuus ?kansallisuus . \n",
    "  OPTIONAL { ?author foaf:gender ?gender }\n",
    "  VALUES ?kansallisuus { <http://www.yso.fi/onto/koko/p2224> <http://www.yso.fi/onto/koko/p607> \t<http://www.yso.fi/onto/koko/p15528> <http://www.yso.fi/onto/koko/p16273> <http://seco.tkk.fi/onto/toimo/nationalities/Scottish_Scots_> <http://seco.tkk.fi/saha3/u47895875-438a-47bb-9565-aec890451cb8> }\n",
    "  #VALUES ?kansallisuus { <http://www.yso.fi/onto/koko/p15010> <http://www.yso.fi/onto/koko/p73101> <http://www.yso.fi/onto/koko/p63178> }\n",
    "  OPTIONAL { ?kansallisuus skos:prefLabel ?klabel FILTER(LANG(?klabel)=\"fi\") }\n",
    "  } GROUP BY ?gender\n",
    "  \"\"\"\n",
    "\n",
    "\n",
    "sparql = SPARQLWrapper(\"http://ldf.fi/booksampo-2022/sparql\")\n",
    "#sparql = SPARQLWrapper(\"http://ldf.fi/kirjasampo/sparql\")\n",
    "sparql.setQuery(PREFIXES + HC)\n",
    "sparql.setReturnFormat(JSON)\n",
    "sparql.addCustomHttpHeader(*list(AUTHORIZATION_HEADER.items())[0])\n",
    "results = sparql.query().convert()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "id": "1434ff9b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>authorcount</th>\n",
       "      <th>authorUris</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>12</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#person_1231759...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>728</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#person_1231759...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>610</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#person_1231759...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   authorcount                                         authorUris\n",
       "0           12  http://www.yso.fi/onto/kaunokki#person_1231759...\n",
       "1          728  http://www.yso.fi/onto/kaunokki#person_1231759...\n",
       "2          610  http://www.yso.fi/onto/kaunokki#person_1231759..."
      ]
     },
     "execution_count": 58,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_check = JSON2Pandas2(results)\n",
    "df_check\n",
    "\n",
    "# the numbers seem to match"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "408be2d4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=N7d19e4acd9ab4cad97a82c5c437beb63 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# seems like g2 got the nationalities right!\n",
    "\n",
    "# save work until now\n",
    "\n",
    "#g2.serialize(destination=\"../../data/nationality_graph.ttl\", format=\"turtle\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "733aa90a",
   "metadata": {},
   "source": [
    "## Correct languages\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "af2e1ceb",
   "metadata": {},
   "source": [
    "The process is somewhat similar to nationalities: print out all languages, \n",
    "see if there are duplicates or incorrect annotations, and clean them up"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "id": "a033cb83",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "24963\n",
      "24963\n",
      "[('http://www.btj.fi/at_1678175', {'http://lexvo.org/id/iso639-3/spa'}), ('http://data.kirjasampo.fi/abstractWork_9789518830927', {'http://lexvo.org/id/iso639-3/eng'}), ('http://www.yso.fi/onto/kaunokki#ateos_9589', {'http://lexvo.org/id/iso639-3/eng'}), ('http://www.yso.fi/onto/kaunokki#ateos_3912', {'http://lexvo.org/id/iso639-3/eng'}), ('http://data.kirjasampo.fi/abstractWork_6834230', {'http://lexvo.org/id/iso639-3/eng'}), ('http://data.kirjasampo.fi/abstractWork_4124516', {'http://lexvo.org/id/iso639-3/eng'}), ('http://www.yso.fi/onto/kaunokki#ateos_2216', {'http://lexvo.org/id/iso639-3/eng'}), ('http://data.kirjasampo.fi/abstractWork_9789511255659', {'http://lexvo.org/id/iso639-3/eng'}), ('http://seco.tkk.fi/saha3/ue552c4bb-ecd8-495d-be5d-00c45f9caaa8', {'http://lexvo.org/id/iso639-3/eng'}), ('http://seco.tkk.fi/saha3/ucf938d75-fc5e-4637-9715-73092ba5482a', {'http://lexvo.org/id/iso639-3/eng'})] [('http://seco.tkk.fi/saha3/ue876b69b-66d0-4f4d-b7f0-1fef463e98c9', {'http://lexvo.org/id/iso639-3/swe'}), ('http://data.kirjasampo.fi/abstractWork_7183655', {'http://lexvo.org/id/iso639-3/deu'}), ('http://www.yso.fi/onto/kaunokki#ateos_7347', {'http://lexvo.org/id/iso639-3/eng'}), ('http://data.kirjasampo.fi/abstractWork_9789187027321', {'http://lexvo.org/id/iso639-3/swe'}), ('http://seco.tkk.fi/saha3/u189d4a12-2e00-409f-a921-4e0d157c4dc7', {'http://lexvo.org/id/iso639-3/eng'}), ('http://www.yso.fi/onto/kaunokki#ateos_49799', {'http://lexvo.org/id/iso639-3/ron'}), ('http://seco.tkk.fi/saha3/u6bcd337d-50e2-4bee-9f51-e7e038d79eda', {'http://lexvo.org/id/iso639-3/swe'}), ('http://www.yso.fi/onto/kaunokki#ateos_4583', {'http://lexvo.org/id/iso639-3/eng'}), ('http://www.yso.fi/onto/kaunokki#ateos_11673', {'http://lexvo.org/id/iso639-3/eng'}), ('http://data.kirjasampo.fi/abstractWork_4226796', {'http://lexvo.org/id/iso639-3/eng'})]\n"
     ]
    }
   ],
   "source": [
    "# initial language lookup\n",
    "# all books should have a language to be included\n",
    "qres = g.query(\"\"\"\n",
    "#PREFIX kaunokki: <http://www.yso.fi/onto/kaunokki#> \n",
    "PREFIX rel: <http://ldf.fi/relse/> \n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX schema: <http://schema.org/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX xml: <http://www.w3.org/XML/1998/namespace>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT ?teos ?lang\n",
    "WHERE {\n",
    "  ?teos a rel:novel ; rel:langOrig ?lang. \n",
    "  #?author foaf:gender ?gender .\n",
    "}  \"\"\")\n",
    "\n",
    "lang_lookup=defaultdict(set)\n",
    "for url, label in qres:\n",
    "    lang_lookup[str(url)].update([str(label)])\n",
    "#print(list(gender_lookup.items())[-10:])\n",
    "print(len(lang_lookup))\n",
    "lang_lookup2 = {novel:\"unk\" for novel in novels if novel not in lang_lookup.keys() }\n",
    "lang_lookup.update(lang_lookup2)\n",
    "print(len(lang_lookup)) \n",
    "print(list(lang_lookup.items())[:10],list(lang_lookup.items())[-10:])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "id": "10032705",
   "metadata": {},
   "outputs": [],
   "source": [
    "# split the name from the last slahs to get the language code\n",
    "\n",
    "qres = g2.query(\"\"\"\n",
    "#PREFIX kaunokki: <http://www.yso.fi/onto/kaunokki#> \n",
    "PREFIX rel: <http://ldf.fi/relse/> \n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX schema: <http://schema.org/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX xml: <http://www.w3.org/XML/1998/namespace>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT DISTINCT ?lang\n",
    "WHERE {\n",
    "  ?teos a rel:novel ; rel:langOrig ?lang. \n",
    "  \n",
    "}  \"\"\")\n",
    "\n",
    "langlabel_lookup = {}\n",
    "\n",
    "for l in qres:\n",
    "    lang=l[\"lang\"].toPython()\n",
    "    #print(lang)\n",
    "    if lang not in langlabel_lookup.keys():\n",
    "        langlabel_lookup[lang]= lang.split(\"/\")[-1]\n",
    "    else:\n",
    "        print(\"oop\",lang)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "id": "a15fe191",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "dict_keys(['http://lexvo.org/id/iso639-3/spa', 'http://lexvo.org/id/iso639-3/eng', 'http://lexvo.org/id/iso639-3/fra', 'http://lexvo.org/id/iso639-3/deu', 'http://lexvo.org/id/iso639-3/dan', 'http://lexvo.org/id/iso639-3/swe', 'http://lexvo.org/id/iso639-3/ita', 'http://lexvo.org/id/iso639-3/sme', 'http://lexvo.org/id/iso639-3/nor', 'http://lexvo.org/id/iso639-3/rus', 'http://lexvo.org/id/iso639-3/jpn', 'http://lexvo.org/id/iso639-3/ara', 'http://lexvo.org/id/iso639-3/heb', 'http://lexvo.org/id/iso639-3/ell', 'http://lexvo.org/id/iso639-3/isl', 'http://lexvo.org/id/iso639-3/est', 'http://lexvo.org/id/iso639-3/por', 'http://lexvo.org/id/iso639-3/zho', 'http://lexvo.org/id/iso639-3/pol', 'http://lexvo.org/id/iso639-3/afr', 'http://lexvo.org/id/iso639-3/nld', 'http://lexvo.org/id/iso639-3/ces', 'http://lexvo.org/id/iso639-3/lav', 'http://lexvo.org/id/iso639-3/hun', 'http://lexvo.org/id/iso639-3/yid', 'http://lexvo.org/id/iso639-3/bul', 'http://lexvo.org/id/iso639-3/lat', 'http://lexvo.org/id/iso639-3/cat', 'http://lexvo.org/id/iso639-3/ukr', 'http://lexvo.org/id/iso639-3/tur', 'http://lexvo.org/id/iso639-3/krl', 'http://lexvo.org/id/iso639-3/ron', 'http://lexvo.org/id/iso639-3/kor', 'http://lexvo.org/id/iso639-3/hbs', 'http://lexvo.org/id/iso639-3/srp', 'http://lexvo.org/id/iso639-3/slv', 'http://www.lingvoj.org/lang/smi', 'http://lexvo.org/id/iso639-3/hrv', 'http://lexvo.org/id/iso639-3/kat', 'http://lexvo.org/id/iso639-3/ind', 'http://lexvo.org/id/iso639-3/kik', 'http://lexvo.org/id/iso639-3/glg', 'http://lexvo.org/id/iso639-3/vls', 'http://lexvo.org/id/iso639-3/kur', 'http://lexvo.org/id/iso639-3/vec', 'http://www.lingvoj.org/lang/en-gb', 'http://www.lingvoj.org/lang/bnt', 'http://lexvo.org/id/iso639-3/ben', 'http://lexvo.org/id/iso639-3/sqi', 'http://lexvo.org/id/iso639-3/nno', 'http://lexvo.org/id/iso639-3/lit', 'http://lexvo.org/id/iso639-3/som', 'http://lexvo.org/id/iso639-3/slk', 'http://www.lingvoj.org/lang/fiu', 'http://lexvo.org/id/iso639-3/fas', 'http://lexvo.org/id/iso639-5/smi', 'http://lexvo.org/id/iso639-3/grc', 'http://lexvo.org/id/iso639-3/eus', 'http://lexvo.org/id/iso639-3/bos', 'http://lexvo.org/id/iso639-3/fit', 'http://www.lingvoj.org/lang/be-x-old', 'http://lexvo.org/id/iso639-3/mkd', 'http://lexvo.org/id/iso639-3/epo', 'http://lexvo.org/id/iso639-3/chm', 'http://lexvo.org/id/iso639-3/vie', 'http://lexvo.org/id/iso639-3/hye', 'http://lexvo.org/id/iso639-3/hin', 'http://lexvo.org/id/iso639-3/mul'])\n"
     ]
    }
   ],
   "source": [
    "# examine the keys\n",
    "print(langlabel_lookup.keys())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "id": "6df5f730",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://www.lingvoj.org/lang/smi smi\n",
      "http://www.lingvoj.org/lang/en-gb en-gb\n",
      "http://www.lingvoj.org/lang/bnt bnt\n",
      "http://www.lingvoj.org/lang/fiu fiu\n",
      "http://www.lingvoj.org/lang/be-x-old be-x-old\n"
     ]
    }
   ],
   "source": [
    "# get the not-lexvo codes\n",
    "oldlang=[]\n",
    "for k,v in langlabel_lookup.items():\n",
    "    if \"lexvo\" not in k:\n",
    "        print(k,v)\n",
    "        oldlang.append(k)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "id": "929fbfc2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://lexvo.org/id/iso639-3/vec vec\n"
     ]
    }
   ],
   "source": [
    "# correct vec, as it is a mistake in the annotations\n",
    "oldlang=[]\n",
    "for k,v in langlabel_lookup.items():\n",
    "    if \"vec\" in k:\n",
    "        print(k,v)\n",
    "        oldlang.append(k)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "id": "e138dd48",
   "metadata": {},
   "outputs": [],
   "source": [
    "# correct list\n",
    "# smi http://www.lexvo.org/page/iso639-5/smi\n",
    "# en-gb http://lexvo.org/id/iso639-3/eng\n",
    "# bnt http://www.lexvo.org/page/iso639-5/bnt\n",
    "# fiu http://www.lexvo.org/page/iso639-5/fiu\n",
    "# be-x-old http://www.lexvo.org/page/iso639-3/bel\n",
    "\n",
    "newlang=[\"http://www.lexvo.org/page/iso639-5/smi\",\"http://lexvo.org/id/iso639-3/eng\",\"http://www.lexvo.org/page/iso639-5/bnt\",\n",
    "        \"http://www.lexvo.org/page/iso639-5/fiu\",\"http://www.lexvo.org/page/iso639-3/bel\"]\n",
    "updated= [\"http://lexvo.org/page/iso639-5/smi\",\"http://lexvo.org/id/iso639-3/eng\",\"http://lexvo.org/page/iso639-5/bnt\",\n",
    "        \"http://lexvo.org/page/iso639-5/fiu\",\"http://lexvo.org/page/iso639-3/bel\"]\n",
    "updated= [\"http://lexvo.org/page/iso639-5/smi\",\"http://lexvo.org/page/iso639-3/eng\",\"http://lexvo.org/page/iso639-5/bnt\",\n",
    "        \"http://lexvo.org/page/iso639-5/fiu\",\"http://lexvo.org/id/iso639-3/bel\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "id": "a315b4c3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://lexvo.org/id/iso639-3/vec http://lexvo.org/id/iso639-3/rus\n",
      "http://lexvo.org/id/iso639-3/vec http://lexvo.org/id/iso639-3/rus\n"
     ]
    }
   ],
   "source": [
    "# vec to rus\n",
    "for o,n in zip([\"http://lexvo.org/id/iso639-3/vec\"],[\"http://lexvo.org/id/iso639-3/rus\"]):\n",
    "    \n",
    "    print(o,n)\n",
    "    old= o\n",
    "    new=n.replace(\"page\",\"id\")\n",
    "    print(o,new)\n",
    "    query=\"\"\"\n",
    "    PREFIX rel: <http://ldf.fi/relse/>\n",
    "             DELETE {?teos rel:langOrig <OLD> }\n",
    "             INSERT { ?teos rel:langOrig  <NEW> }\n",
    "             WHERE { ?teos rel:langOrig <OLD> }\n",
    "             \"\"\"\n",
    "    q=query.replace(\"OLD\",old).replace(\"NEW\",new)\n",
    "    g2.update(q)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 78,
   "id": "db75f8d3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://www.lingvoj.org/lang/smi http://www.lexvo.org/page/iso639-5/smi\n",
      "after correction:\n",
      " http://www.lingvoj.org/lang/smi http://www.lexvo.org/page/iso639-5/smi\n",
      "http://www.lingvoj.org/lang/en-gb http://lexvo.org/id/iso639-3/eng\n",
      "after correction:\n",
      " http://www.lingvoj.org/lang/en-gb http://lexvo.org/id/iso639-3/eng\n",
      "http://www.lingvoj.org/lang/bnt http://www.lexvo.org/page/iso639-5/bnt\n",
      "after correction:\n",
      " http://www.lingvoj.org/lang/bnt http://www.lexvo.org/page/iso639-5/bnt\n",
      "http://www.lingvoj.org/lang/fiu http://www.lexvo.org/page/iso639-5/fiu\n",
      "after correction:\n",
      " http://www.lingvoj.org/lang/fiu http://www.lexvo.org/page/iso639-5/fiu\n",
      "http://www.lingvoj.org/lang/be-x-old http://www.lexvo.org/page/iso639-3/bel\n",
      "after correction:\n",
      " http://www.lingvoj.org/lang/be-x-old http://www.lexvo.org/page/iso639-3/bel\n"
     ]
    }
   ],
   "source": [
    "# correct my own mistake to have the right URIs with \"id\" instade of \"page\" in the URI\n",
    "for o,n in zip(oldlang,newlang):\n",
    "    \n",
    "    print(o,n)\n",
    "    #old= n\n",
    "    #new=n.replace(\"page\",\"id\")\n",
    "    print(\"after correction:\\n\",o,n)\n",
    "    query=\"\"\"\n",
    "             DELETE {?teos rel:langOrig <OLD> }\n",
    "             INSERT { ?teos rel:langOrig  <NEW> }\n",
    "             WHERE { ?teos rel:langOrig <OLD> }\n",
    "             \"\"\"\n",
    "    q=query.replace(\"OLD\",o).replace(\"NEW\",n)\n",
    "    g2.update(q)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 79,
   "id": "fb5b9d1b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://www.lexvo.org/page/iso639-5/smi http://lexvo.org/page/iso639-5/smi\n",
      "after correction:\n",
      " http://www.lexvo.org/page/iso639-5/smi http://lexvo.org/id/iso639-5/smi\n",
      "http://lexvo.org/id/iso639-3/eng http://lexvo.org/id/iso639-3/eng\n",
      "after correction:\n",
      " http://lexvo.org/id/iso639-3/eng http://lexvo.org/id/iso639-3/eng\n",
      "http://www.lexvo.org/page/iso639-5/bnt http://lexvo.org/page/iso639-5/bnt\n",
      "after correction:\n",
      " http://www.lexvo.org/page/iso639-5/bnt http://lexvo.org/id/iso639-5/bnt\n",
      "http://www.lexvo.org/page/iso639-5/fiu http://lexvo.org/page/iso639-5/fiu\n",
      "after correction:\n",
      " http://www.lexvo.org/page/iso639-5/fiu http://lexvo.org/id/iso639-5/fiu\n",
      "http://www.lexvo.org/page/iso639-3/bel http://lexvo.org/page/iso639-3/bel\n",
      "after correction:\n",
      " http://www.lexvo.org/page/iso639-3/bel http://lexvo.org/id/iso639-3/bel\n"
     ]
    }
   ],
   "source": [
    "# correct my own mistake to have the right URIs with \"id\" instade of \"page\" in the URI\n",
    "for o,n in zip(newlang,updated):\n",
    "    \n",
    "    print(o,n)\n",
    "    old= n\n",
    "    new=n.replace(\"page\",\"id\")\n",
    "    print(\"after correction:\\n\",o,new)\n",
    "    query=\"\"\"\n",
    "             DELETE {?teos rel:langOrig <OLD> }\n",
    "             INSERT { ?teos rel:langOrig  <NEW> }\n",
    "             WHERE { ?teos rel:langOrig <OLD> }\n",
    "             \"\"\"\n",
    "    q=query.replace(\"OLD\",old).replace(\"NEW\",new)\n",
    "    g2.update(q)\n",
    "    \n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 80,
   "id": "6c146980",
   "metadata": {},
   "outputs": [],
   "source": [
    "for n in newlang:\n",
    "    g2.add((URIRef(n), RDF.type, rel.lang)) # make sure the type lang exists"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "id": "a627455d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "24680\n",
      "[('http://www.btj.fi/at_1678175', {'http://lexvo.org/id/iso639-3/spa'}), ('http://data.kirjasampo.fi/abstractWork_9789518830927', {'http://lexvo.org/id/iso639-3/eng'}), ('http://www.yso.fi/onto/kaunokki#ateos_9589', {'http://lexvo.org/id/iso639-3/eng'}), ('http://www.yso.fi/onto/kaunokki#ateos_3912', {'http://lexvo.org/id/iso639-3/eng'}), ('http://data.kirjasampo.fi/abstractWork_6834230', {'http://lexvo.org/id/iso639-3/eng'}), ('http://data.kirjasampo.fi/abstractWork_4124516', {'http://lexvo.org/id/iso639-3/eng'}), ('http://www.yso.fi/onto/kaunokki#ateos_2216', {'http://lexvo.org/id/iso639-3/eng'}), ('http://data.kirjasampo.fi/abstractWork_9789511255659', {'http://lexvo.org/id/iso639-3/eng'}), ('http://seco.tkk.fi/saha3/ue552c4bb-ecd8-495d-be5d-00c45f9caaa8', {'http://lexvo.org/id/iso639-3/eng'}), ('http://seco.tkk.fi/saha3/ucf938d75-fc5e-4637-9715-73092ba5482a', {'http://lexvo.org/id/iso639-3/eng'})] [('http://seco.tkk.fi/saha3/ue876b69b-66d0-4f4d-b7f0-1fef463e98c9', {'http://lexvo.org/id/iso639-3/swe'}), ('http://data.kirjasampo.fi/abstractWork_7183655', {'http://lexvo.org/id/iso639-3/deu'}), ('http://www.yso.fi/onto/kaunokki#ateos_7347', {'http://lexvo.org/id/iso639-3/eng'}), ('http://data.kirjasampo.fi/abstractWork_9789187027321', {'http://lexvo.org/id/iso639-3/swe'}), ('http://seco.tkk.fi/saha3/u189d4a12-2e00-409f-a921-4e0d157c4dc7', {'http://lexvo.org/id/iso639-3/eng'}), ('http://www.yso.fi/onto/kaunokki#ateos_49799', {'http://lexvo.org/id/iso639-3/ron'}), ('http://seco.tkk.fi/saha3/u6bcd337d-50e2-4bee-9f51-e7e038d79eda', {'http://lexvo.org/id/iso639-3/swe'}), ('http://www.yso.fi/onto/kaunokki#ateos_4583', {'http://lexvo.org/id/iso639-3/eng'}), ('http://www.yso.fi/onto/kaunokki#ateos_11673', {'http://lexvo.org/id/iso639-3/eng'}), ('http://data.kirjasampo.fi/abstractWork_4226796', {'http://lexvo.org/id/iso639-3/eng'})]\n"
     ]
    }
   ],
   "source": [
    "# new language lookup\n",
    "\n",
    "qres = g2.query(\"\"\"\n",
    "#PREFIX kaunokki: <http://www.yso.fi/onto/kaunokki#> \n",
    "PREFIX rel: <http://ldf.fi/relse/> \n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX schema: <http://schema.org/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX xml: <http://www.w3.org/XML/1998/namespace>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT ?teos ?lang\n",
    "WHERE {\n",
    "  ?teos a rel:novel ; rel:langOrig ?lang  ; rel:pubYear ?year .\n",
    "  FILTER(?year > 1899)\n",
    "  #?author foaf:gender ?gender .\n",
    "}  \"\"\")\n",
    "\n",
    "lang_lookup=defaultdict(set)\n",
    "for url, label in qres:\n",
    "    lang_lookup[str(url)].update([str(label)])\n",
    "\n",
    "print(len(lang_lookup))\n",
    "\n",
    "print(list(lang_lookup.items())[:10],list(lang_lookup.items())[-10:])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 82,
   "id": "58390d9e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 82,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "oldlang=[]\n",
    "for k,v in langlabel_lookup.items():\n",
    "    if \"page\"  in k:\n",
    "        print(k,v)\n",
    "        oldlang.append(k)\n",
    "oldlang # so all with correct \"id\" URIs"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "id": "dd387f39",
   "metadata": {},
   "outputs": [],
   "source": [
    "# count languages\n",
    "\n",
    "countdict=defaultdict(int)\n",
    "n=0\n",
    "for k,v in lang_lookup.items():\n",
    "    if v == \"unk\":\n",
    "        print(v)\n",
    "        countdict[v] +=1\n",
    "    else:\n",
    "        for val in v:\n",
    "            label=val.split(\"/\")[-1]\n",
    "            #print(label)\n",
    "            #if len(label) ==1:\n",
    "            countdict[label] += 1\n",
    "            #elif len(label) > 1:\n",
    "             #   print(label)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 92,
   "id": "1103606f",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>0</th>\n",
       "      <th>1</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>53</th>\n",
       "      <td>fas</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>54</th>\n",
       "      <td>grc</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>hrv</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>51</th>\n",
       "      <td>slk</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>lat</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>kat</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>ukr</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>lit</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>nno</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>ind</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>63</th>\n",
       "      <td>hye</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>64</th>\n",
       "      <td>hin</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>59</th>\n",
       "      <td>mkd</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>60</th>\n",
       "      <td>epo</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>57</th>\n",
       "      <td>fit</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>61</th>\n",
       "      <td>chm</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>56</th>\n",
       "      <td>bos</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>62</th>\n",
       "      <td>vie</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>58</th>\n",
       "      <td>bel</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>bnt</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>52</th>\n",
       "      <td>fiu</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>som</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>ben</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>vec</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>kur</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>vls</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>glg</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>kik</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>krl</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65</th>\n",
       "      <td>mul</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      0  1\n",
       "53  fas  5\n",
       "54  grc  5\n",
       "37  hrv  5\n",
       "51  slk  4\n",
       "26  lat  4\n",
       "38  kat  3\n",
       "28  ukr  3\n",
       "49  lit  3\n",
       "48  nno  3\n",
       "39  ind  2\n",
       "63  hye  2\n",
       "64  hin  1\n",
       "59  mkd  1\n",
       "60  epo  1\n",
       "57  fit  1\n",
       "61  chm  1\n",
       "56  bos  1\n",
       "62  vie  1\n",
       "58  bel  1\n",
       "45  bnt  1\n",
       "52  fiu  1\n",
       "50  som  1\n",
       "46  ben  1\n",
       "44  vec  1\n",
       "43  kur  1\n",
       "42  vls  1\n",
       "41  glg  1\n",
       "40  kik  1\n",
       "30  krl  1\n",
       "65  mul  1"
      ]
     },
     "execution_count": 92,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "#see the tail\n",
    "\n",
    "natdf=pd.DataFrame(countdict.items())\n",
    "natdf.sort_values(by=1,ascending=False).tail(30)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 91,
   "id": "efd12e40",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>authorcount</th>\n",
       "      <th>authorUris</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>52</td>\n",
       "      <td>http://www.yso.fi/onto/kaunokki#person_1231759...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   authorcount                                         authorUris\n",
       "0           52  http://www.yso.fi/onto/kaunokki#person_1231759..."
      ]
     },
     "execution_count": 91,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "# SPARQL checks\n",
    "\n",
    "HC=\"\"\"\n",
    "SELECT  (COUNT(DISTINCT ?teos) as ?authorcount) (GROUP_CONCAT(?author; separator=\";\") AS ?authorUris) WHERE {\n",
    "  \n",
    "  ?teos  a kaunokki:romaani ; kaunokki:tekija ?author ; skos:prefLabel ?title.\n",
    "  ?teos kaunokki:alkukieli ?kieliuri .\n",
    "  FILTER (?kieliuri !=  <http://lexvo.org/id/iso639-3/fin>  )\n",
    "  VALUES ?kieliuri { <http://lexvo.org/id/iso639-3/ces> }\n",
    "  ?teos kaunokki:manifests_in ?julkaisu .\n",
    "  ?julkaisu kaunokki:kieli <http://lexvo.org/id/iso639-3/fin> . # käännetty suomeksi\n",
    "  ?julkaisu kaunokki:ilmestymisvuosi ?vuosi . ?vuosi skos:prefLabel ?vuosiluku .\n",
    "  #BIND(regex(str(?vuosiluku), \"197\" ) AS ?decade)\n",
    "  \n",
    "  #FILTER(?decade = xsd:boolean(\"true\"))\n",
    "  FILTER(xsd:integer(?vuosiluku) > 1899)\n",
    "  \n",
    "  \n",
    "  }\n",
    "  \"\"\"\n",
    "\n",
    "\n",
    "sparql = SPARQLWrapper(\"http://ldf.fi/booksampo-2022/sparql\")\n",
    "#sparql = SPARQLWrapper(\"http://ldf.fi/kirjasampo/sparql\")\n",
    "sparql.setQuery(PREFIXES + HC)\n",
    "sparql.setReturnFormat(JSON)\n",
    "sparql.addCustomHttpHeader(*list(AUTHORIZATION_HEADER.items())[0])\n",
    "results = sparql.query().convert()\n",
    "\n",
    "df_check = JSON2Pandas2(results)\n",
    "df_check"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 93,
   "id": "5d8f49dd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>0</th>\n",
       "      <th>1</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>ces</td>\n",
       "      <td>52</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      0   1\n",
       "21  ces  52"
      ]
     },
     "execution_count": 93,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#matches with my amount\n",
    "natdf[natdf[0]==\"ces\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 94,
   "id": "91ff89aa",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://lexvo.org/id/iso639-3/zho\n",
      "http://lexvo.org/id/iso639-3/hin\n",
      "http://lexvo.org/id/iso639-3/slv\n",
      "http://lexvo.org/id/iso639-3/fit\n",
      "http://lexvo.org/id/iso639-3/jpn\n",
      "http://lexvo.org/id/iso639-3/ben\n",
      "http://lexvo.org/id/iso639-3/sqi\n",
      "http://lexvo.org/id/iso639-3/rus\n",
      "http://lexvo.org/id/iso639-3/swe\n",
      "http://www.lingvoj.org/lang/be-x-old\n",
      "http://lexvo.org/id/iso639-3/spa\n",
      "http://lexvo.org/id/iso639-3/afr\n",
      "http://lexvo.org/id/iso639-3/hye\n",
      "http://lexvo.org/id/iso639-3/dan\n",
      "http://lexvo.org/id/iso639-3/som\n",
      "http://lexvo.org/id/iso639-3/pol\n",
      "http://lexvo.org/id/iso639-3/vec\n",
      "http://lexvo.org/id/iso639-3/hrv\n",
      "http://lexvo.org/id/iso639-3/chm\n",
      "http://lexvo.org/id/iso639-3/nor\n",
      "http://www.lingvoj.org/lang/en-gb\n",
      "http://lexvo.org/id/iso639-3/heb\n",
      "http://lexvo.org/id/iso639-3/tur\n",
      "http://lexvo.org/id/iso639-3/kor\n",
      "http://lexvo.org/id/iso639-3/yid\n",
      "http://lexvo.org/id/iso639-3/eng\n",
      "http://lexvo.org/id/iso639-3/hun\n",
      "http://lexvo.org/id/iso639-3/slk\n",
      "http://lexvo.org/id/iso639-3/vie\n",
      "http://lexvo.org/id/iso639-3/hbs\n",
      "http://www.lingvoj.org/lang/smi\n",
      "http://lexvo.org/id/iso639-3/por\n",
      "http://lexvo.org/id/iso639-3/bul\n",
      "http://lexvo.org/id/iso639-3/mul\n",
      "http://lexvo.org/id/iso639-3/kur\n",
      "http://lexvo.org/id/iso639-3/ukr\n",
      "http://lexvo.org/id/iso639-3/lat\n",
      "http://lexvo.org/id/iso639-3/nno\n",
      "http://lexvo.org/id/iso639-5/smi\n",
      "http://lexvo.org/id/iso639-3/ron\n",
      "http://lexvo.org/id/iso639-3/ell\n",
      "http://lexvo.org/id/iso639-3/glg\n",
      "http://lexvo.org/id/iso639-3/krl\n",
      "http://lexvo.org/id/iso639-3/bos\n",
      "http://lexvo.org/id/iso639-3/grc\n",
      "http://lexvo.org/id/iso639-3/lav\n",
      "http://lexvo.org/id/iso639-3/deu\n",
      "http://www.lingvoj.org/lang/fiu\n",
      "http://lexvo.org/id/iso639-3/fas\n",
      "http://lexvo.org/id/iso639-3/sme\n",
      "http://lexvo.org/id/iso639-3/ara\n",
      "http://www.lingvoj.org/lang/bnt\n",
      "http://lexvo.org/id/iso639-3/est\n",
      "http://lexvo.org/id/iso639-3/mkd\n",
      "http://lexvo.org/id/iso639-3/kik\n",
      "http://lexvo.org/id/iso639-3/vls\n",
      "http://lexvo.org/id/iso639-3/eus\n",
      "http://lexvo.org/id/iso639-3/cat\n",
      "http://lexvo.org/id/iso639-3/ind\n",
      "http://lexvo.org/id/iso639-3/lit\n",
      "http://lexvo.org/id/iso639-3/ita\n",
      "http://lexvo.org/id/iso639-3/epo\n",
      "http://lexvo.org/id/iso639-3/isl\n",
      "http://lexvo.org/id/iso639-3/fra\n",
      "http://lexvo.org/id/iso639-3/kat\n",
      "http://lexvo.org/id/iso639-3/ces\n",
      "http://lexvo.org/id/iso639-3/srp\n",
      "http://lexvo.org/id/iso639-3/nld\n",
      "http://www.lexvo.org/page/iso639-5/smi\n",
      "http://www.lexvo.org/page/iso639-5/bnt\n",
      "http://www.lexvo.org/page/iso639-5/fiu\n",
      "http://www.lexvo.org/page/iso639-3/bel\n"
     ]
    }
   ],
   "source": [
    "# remove all language labels\n",
    "for s, p, o in g2.triples((None, RDF.type, rel.lang)):\n",
    "    #g.add((s, FOAF['name'], o))\n",
    "    print(s)\n",
    "    g2.remove((s, SKOS.prefLabel, None))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 78,
   "id": "0a0b7377",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/u/98/peurat1/unix/kirjasampo/benv/lib/python3.8/site-packages/rdflib/plugins/serializers/nt.py:36: UserWarning: NTSerializer always uses UTF-8 encoding. Given encoding was: None\n",
      "  warnings.warn(\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "<Graph identifier=Nae544eb22f6243d2aabd69c1fd567e8c (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 78,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#save!\n",
    "\n",
    "#g2.serialize(destination=\"../../data/nat_lang_graph2.nt\",format=\"nt\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3e24e94d",
   "metadata": {},
   "source": [
    "# Finnish graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 96,
   "id": "53c1429b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "*** constructing the graph\n"
     ]
    }
   ],
   "source": [
    "# Query\n",
    "Q = \"\"\"\n",
    "PREFIX rel: <http://ldf.fi/relse/>\n",
    "\n",
    "CONSTRUCT {\n",
    "\n",
    "\n",
    "?teos a rel:novel ;\n",
    "    skos:prefLabel ?title ;\n",
    "    rel:langOrig ?kieliuri ;\n",
    "    rel:hasAuthor ?author ;\n",
    "    rel:pubYear ?vuosi_ .\n",
    "\n",
    "\n",
    "?author a rel:author ;\n",
    "\tskos:prefLabel ?authorname ;\n",
    "\tfoaf:gender ?gender ;\n",
    "\trel:authorNationality ?kansallisuusuri .\n",
    "\n",
    "?kieliuri a rel:lang .\n",
    "\t#skos:prefLabel ?kieli .\n",
    "\n",
    "?kansallisuusuri a rel:nationality ;\n",
    "\tskos:prefLabel ?kansallisuus. \n",
    "\n",
    "}\n",
    "\n",
    "WHERE {\n",
    "\n",
    "  ?teos a kaunokki:romaani ; skos:prefLabel ?title .\n",
    "  ?teos kaunokki:alkukieli ?kieliuri .\n",
    "  FILTER (?kieliuri =  <http://lexvo.org/id/iso639-3/fin>  ) # original language Finnish\n",
    "  \n",
    "  #OPTIONAL {?kieliuri skos:prefLabel ?kieli . }\n",
    "  ?teos kaunokki:manifests_in ?julkaisu .\n",
    "  \n",
    "  ?julkaisu kaunokki:kieli <http://lexvo.org/id/iso639-3/fin> . # publication language Finnish\n",
    "  \n",
    "  ?julkaisu kaunokki:ilmestymisvuosi ?vuosi . ?vuosi skos:prefLabel ?vuosiluku .\n",
    "  ?julkaisu kaunokki:onEnsimmainenVersio ?true .\n",
    "  BIND(xsd:integer(?vuosiluku) AS ?vuosi_)\n",
    "  FILTER(?vuosi_ > 1969)\n",
    "  ?teos kaunokki:tekija ?author.\n",
    "  ?author skos:prefLabel ?authorname .\n",
    "OPTIONAL {?author kaunokki:kansallisuus ?kansallisuusuri . OPTIONAL { ?kansallisuusuri skos:prefLabel ?kansallisuus .} }\n",
    "OPTIONAL  {?author foaf:gender ?gender }\n",
    "\n",
    "\n",
    "} \n",
    "\"\"\"\n",
    "\n",
    "\n",
    "# construct graph\n",
    "\n",
    "# query graph\n",
    "print('\\n\\n*** constructing the graph')\n",
    "sparql = SPARQLWrapper(\"http://ldf.fi/booksampo-2022/sparql\")\n",
    "\n",
    "sparql.setQuery(PREFIXES + Q)\n",
    "\n",
    "sparql.addCustomHttpHeader(*list(AUTHORIZATION_HEADER.items())[0])\n",
    "\n",
    "sparql.setReturnFormat(TURTLE)\n",
    "results = sparql.query().convert()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "id": "09114a95",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=N367f0fe58cf34b0a92b6cc8c078a9ef3 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 97,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "f = Graph()\n",
    "#g.parse(data=results, format=\"turtle\") # \"mygraph.ttl\"\n",
    "f.parse(data=results, format=\"turtle\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 98,
   "id": "77fddcd9",
   "metadata": {},
   "outputs": [],
   "source": [
    "Q_fi =\"\"\"\n",
    "\n",
    "SELECT  (COUNT(DISTINCT ?teosfi) AS ?novels) (COUNT(DISTINCT ?author) AS ?authors) #?vuosi #(MIN(?vuosi) AS ?julkaisuvuosi)  \n",
    "{\n",
    "?teosfi a rel:novel .\n",
    "  ?teosfi rel:langOrig <http://lexvo.org/id/iso639-3/fin> .\n",
    "    ?teosfi rel:hasAuthor ?author .\n",
    "  ?teosfi rel:pubYear ?vuosi . #?vuosir skos:prefLabel ?vuosiluku .\n",
    "  #BIND(xsd:integer(?vuosiluku) AS ?vuosi)\n",
    "  BIND(regex(str(?vuosi), \"199\" ) AS ?decade)\n",
    "  FILTER(?decade = xsd:boolean(\"true\"))\n",
    "  \n",
    "  } #GROUP BY ?vuosi\n",
    "  \n",
    "\"\"\"\n",
    "\n",
    "decades=[197,198,199,200,201]\n",
    "df_authorsfi=pd.DataFrame()\n",
    "for d in decades:\n",
    "    q=Q_fi.replace(\"199\", str(d))\n",
    "    qres = f.query(q)\n",
    "    \n",
    "    for row in qres:\n",
    "        n = str(row.asdict()['novels'].toPython())   \n",
    "        #natname = str(row.asdict()['label'].toPython())   \n",
    "        a = str(row.asdict()['authors'].toPython()) \n",
    "        temp=pd.DataFrame({\"authors\":a, \"novels\":n}.values() ).T.rename({0:\"authors\",1:\"novels\"},axis=1)\n",
    "        temp[\"decade\"] = d*10\n",
    "    df_authorsfi=pd.concat([df_authorsfi,temp])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 99,
   "id": "09f1467e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>authors</th>\n",
       "      <th>novels</th>\n",
       "      <th>decade</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>707</td>\n",
       "      <td>1455</td>\n",
       "      <td>1970</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>813</td>\n",
       "      <td>1891</td>\n",
       "      <td>1980</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>974</td>\n",
       "      <td>2281</td>\n",
       "      <td>1990</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1569</td>\n",
       "      <td>3609</td>\n",
       "      <td>2000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2926</td>\n",
       "      <td>6409</td>\n",
       "      <td>2010</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  authors novels  decade\n",
       "0     707   1455    1970\n",
       "0     813   1891    1980\n",
       "0     974   2281    1990\n",
       "0    1569   3609    2000\n",
       "0    2926   6409    2010"
      ]
     },
     "execution_count": 99,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_authorsfi"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "id": "f01fe275",
   "metadata": {},
   "outputs": [],
   "source": [
    "# nationalities\n",
    "\n",
    "Q_kans =\"\"\"\n",
    "PREFIX rel: <http://ldf.fi/relse/> \n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX schema: <http://schema.org/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX xml: <http://www.w3.org/XML/1998/namespace>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT DISTINCT ?kansallisuus (SAMPLE(?klabel) AS ?label) (COUNT(DISTINCT ?author) as ?authorcount) (COUNT(DISTINCT ?teos) as ?workcount) WHERE {\n",
    "  \n",
    "  ?teos  a rel:novel ; rel:hasAuthor ?author .\n",
    "  \n",
    "  ?teos rel:pubYear ?vuosi . #?vuosi skos:prefLabel ?vuosiluku .\n",
    "  #BIND(regex(str(?vuosi), \"199\" ) AS ?decade)\n",
    "  #FILTER(?decade = xsd:boolean(\"true\"))\n",
    "  ?author rel:authorNationality ?kansallisuus . OPTIONAL { ?kansallisuus skos:prefLabel ?klabel FILTER(LANG(?klabel)=\"fi\") }\n",
    "  } GROUP BY ?kansallisuus\n",
    "ORDER BY DESC(xsd:integer(?authorcount))\n",
    "\"\"\"\n",
    "\n",
    "decades=[197,198,199,200,201]\n",
    "\n",
    "qres = f.query(Q_kans)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "id": "0895667b",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>authors</th>\n",
       "      <th>novels</th>\n",
       "      <th>nationality</th>\n",
       "      <th>label</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p57886</td>\n",
       "      <td>afganistanilaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p14632</td>\n",
       "      <td>alankomaalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p9135</td>\n",
       "      <td>australialaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p34688</td>\n",
       "      <td>inkeriläiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p40957</td>\n",
       "      <td>inkerinsuomalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p5227</td>\n",
       "      <td>intialaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p53753</td>\n",
       "      <td>iranilaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>http://seco.tkk.fi/saha3/u5aa143b0-c88f-47a0-8...</td>\n",
       "      <td>israelilaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>4</td>\n",
       "      <td>10</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p54872</td>\n",
       "      <td>kanadalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3</td>\n",
       "      <td>7</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p34058</td>\n",
       "      <td>karjalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p14667</td>\n",
       "      <td>kiinalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>3</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p55493</td>\n",
       "      <td>kosovolaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p36891</td>\n",
       "      <td>metsätyöntekijät</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p52909</td>\n",
       "      <td>nainen</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>5</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p13034</td>\n",
       "      <td>neuvostoliittolaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>3</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p3113</td>\n",
       "      <td>norjalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>4</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p33980</td>\n",
       "      <td>opettajat</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p3437</td>\n",
       "      <td>ranskalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>8</td>\n",
       "      <td>20</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p16897</td>\n",
       "      <td>ruotsalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>38</td>\n",
       "      <td>74</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p2682</td>\n",
       "      <td>ruotsinsuomalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>6</td>\n",
       "      <td>7</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p32570</td>\n",
       "      <td>saamelaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p745</td>\n",
       "      <td>saksalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p11118</td>\n",
       "      <td>somalit</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>5681</td>\n",
       "      <td>17384</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p35259</td>\n",
       "      <td>suomalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p17502</td>\n",
       "      <td>tamilit</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p6292</td>\n",
       "      <td>tanskalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p34461</td>\n",
       "      <td>unkarilaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>4</td>\n",
       "      <td>6</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p8327</td>\n",
       "      <td>venäläiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>6</td>\n",
       "      <td>17</td>\n",
       "      <td>http://seco.tkk.fi/saha3/u86d688aa-7a9f-4e6d-9...</td>\n",
       "      <td>vienankarjalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p32714</td>\n",
       "      <td>virolaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3</td>\n",
       "      <td>5</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p73101</td>\n",
       "      <td>yhdysvaltalaiset</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  authors novels                                        nationality  \\\n",
       "0       1      2                 http://www.yso.fi/onto/koko/p57886   \n",
       "0       1      1                 http://www.yso.fi/onto/koko/p14632   \n",
       "0       1      2                  http://www.yso.fi/onto/koko/p9135   \n",
       "0       1      1                 http://www.yso.fi/onto/koko/p34688   \n",
       "0       1      1                 http://www.yso.fi/onto/koko/p40957   \n",
       "0       2      2                  http://www.yso.fi/onto/koko/p5227   \n",
       "0       2      4                 http://www.yso.fi/onto/koko/p53753   \n",
       "0       1      2  http://seco.tkk.fi/saha3/u5aa143b0-c88f-47a0-8...   \n",
       "0       4     10                 http://www.yso.fi/onto/koko/p54872   \n",
       "0       3      7                 http://www.yso.fi/onto/koko/p34058   \n",
       "0       1      2                 http://www.yso.fi/onto/koko/p14667   \n",
       "0       1      3                 http://www.yso.fi/onto/koko/p55493   \n",
       "0       1      1                 http://www.yso.fi/onto/koko/p36891   \n",
       "0       1      1                 http://www.yso.fi/onto/koko/p52909   \n",
       "0       1      5                 http://www.yso.fi/onto/koko/p13034   \n",
       "0       1      3                  http://www.yso.fi/onto/koko/p3113   \n",
       "0       1      4                 http://www.yso.fi/onto/koko/p33980   \n",
       "0       1      1                  http://www.yso.fi/onto/koko/p3437   \n",
       "0       8     20                 http://www.yso.fi/onto/koko/p16897   \n",
       "0      38     74                  http://www.yso.fi/onto/koko/p2682   \n",
       "0       6      7                 http://www.yso.fi/onto/koko/p32570   \n",
       "0       2      4                   http://www.yso.fi/onto/koko/p745   \n",
       "0       2      3                 http://www.yso.fi/onto/koko/p11118   \n",
       "0    5681  17384                 http://www.yso.fi/onto/koko/p35259   \n",
       "0       1      1                 http://www.yso.fi/onto/koko/p17502   \n",
       "0       1      1                  http://www.yso.fi/onto/koko/p6292   \n",
       "0       2      2                 http://www.yso.fi/onto/koko/p34461   \n",
       "0       4      6                  http://www.yso.fi/onto/koko/p8327   \n",
       "0       6     17  http://seco.tkk.fi/saha3/u86d688aa-7a9f-4e6d-9...   \n",
       "0       1      1                 http://www.yso.fi/onto/koko/p32714   \n",
       "0       3      5                 http://www.yso.fi/onto/koko/p73101   \n",
       "\n",
       "                  label  \n",
       "0     afganistanilaiset  \n",
       "0       alankomaalaiset  \n",
       "0       australialaiset  \n",
       "0          inkeriläiset  \n",
       "0    inkerinsuomalaiset  \n",
       "0           intialaiset  \n",
       "0           iranilaiset  \n",
       "0         israelilaiset  \n",
       "0          kanadalaiset  \n",
       "0           karjalaiset  \n",
       "0           kiinalaiset  \n",
       "0          kosovolaiset  \n",
       "0      metsätyöntekijät  \n",
       "0                nainen  \n",
       "0  neuvostoliittolaiset  \n",
       "0           norjalaiset  \n",
       "0             opettajat  \n",
       "0          ranskalaiset  \n",
       "0          ruotsalaiset  \n",
       "0    ruotsinsuomalaiset  \n",
       "0           saamelaiset  \n",
       "0           saksalaiset  \n",
       "0               somalit  \n",
       "0           suomalaiset  \n",
       "0               tamilit  \n",
       "0          tanskalaiset  \n",
       "0          unkarilaiset  \n",
       "0            venäläiset  \n",
       "0     vienankarjalaiset  \n",
       "0            virolaiset  \n",
       "0      yhdysvaltalaiset  "
      ]
     },
     "execution_count": 101,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "fidf=pd.DataFrame()\n",
    "for row in qres:\n",
    "    n = str(row.asdict()['kansallisuus'].toPython())   \n",
    "    natname = str(row.asdict()['label'].toPython())   \n",
    "    a = str(row.asdict()['authorcount'].toPython()) \n",
    "    w = str(row.asdict()['workcount'].toPython()) \n",
    "    temp=pd.DataFrame({\"authors\":a, \"novels\":w,\"nationality\":n, \"natname\":natname}.values() ).T.rename({0:\"authors\",1:\"novels\",2:\"nationality\",3:\"label\"},axis=1)\n",
    "    fidf=pd.concat([fidf,temp])\n",
    "    \n",
    "fidf.sort_values(by=\"label\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "7170970c",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>authors</th>\n",
       "      <th>novels</th>\n",
       "      <th>nationality</th>\n",
       "      <th>label</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p57886</td>\n",
       "      <td>afganistanilaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p14632</td>\n",
       "      <td>alankomaalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p9135</td>\n",
       "      <td>australialaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p34688</td>\n",
       "      <td>inkeriläiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p40957</td>\n",
       "      <td>inkerinsuomalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p5227</td>\n",
       "      <td>intialaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p53753</td>\n",
       "      <td>iranilaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>http://seco.tkk.fi/saha3/u5aa143b0-c88f-47a0-8...</td>\n",
       "      <td>israelilaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>4</td>\n",
       "      <td>10</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p54872</td>\n",
       "      <td>kanadalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3</td>\n",
       "      <td>7</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p34058</td>\n",
       "      <td>karjalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p14667</td>\n",
       "      <td>kiinalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>3</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p55493</td>\n",
       "      <td>kosovolaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p36891</td>\n",
       "      <td>metsätyöntekijät</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p52909</td>\n",
       "      <td>nainen</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>5</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p13034</td>\n",
       "      <td>neuvostoliittolaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>3</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p3113</td>\n",
       "      <td>norjalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>4</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p33980</td>\n",
       "      <td>opettajat</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p3437</td>\n",
       "      <td>ranskalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>8</td>\n",
       "      <td>20</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p16897</td>\n",
       "      <td>ruotsalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>38</td>\n",
       "      <td>74</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p2682</td>\n",
       "      <td>ruotsinsuomalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>6</td>\n",
       "      <td>7</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p32570</td>\n",
       "      <td>saamelaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p745</td>\n",
       "      <td>saksalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p11118</td>\n",
       "      <td>somalit</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>5681</td>\n",
       "      <td>17384</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p35259</td>\n",
       "      <td>suomalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p17502</td>\n",
       "      <td>tamilit</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p6292</td>\n",
       "      <td>tanskalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p34461</td>\n",
       "      <td>unkarilaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>4</td>\n",
       "      <td>6</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p8327</td>\n",
       "      <td>venäläiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>6</td>\n",
       "      <td>17</td>\n",
       "      <td>http://seco.tkk.fi/saha3/u86d688aa-7a9f-4e6d-9...</td>\n",
       "      <td>vienankarjalaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p32714</td>\n",
       "      <td>virolaiset</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3</td>\n",
       "      <td>5</td>\n",
       "      <td>http://www.yso.fi/onto/koko/p73101</td>\n",
       "      <td>yhdysvaltalaiset</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  authors novels                                        nationality  \\\n",
       "0       1      2                 http://www.yso.fi/onto/koko/p57886   \n",
       "0       1      1                 http://www.yso.fi/onto/koko/p14632   \n",
       "0       1      2                  http://www.yso.fi/onto/koko/p9135   \n",
       "0       1      1                 http://www.yso.fi/onto/koko/p34688   \n",
       "0       1      1                 http://www.yso.fi/onto/koko/p40957   \n",
       "0       2      2                  http://www.yso.fi/onto/koko/p5227   \n",
       "0       2      4                 http://www.yso.fi/onto/koko/p53753   \n",
       "0       1      2  http://seco.tkk.fi/saha3/u5aa143b0-c88f-47a0-8...   \n",
       "0       4     10                 http://www.yso.fi/onto/koko/p54872   \n",
       "0       3      7                 http://www.yso.fi/onto/koko/p34058   \n",
       "0       1      2                 http://www.yso.fi/onto/koko/p14667   \n",
       "0       1      3                 http://www.yso.fi/onto/koko/p55493   \n",
       "0       1      1                 http://www.yso.fi/onto/koko/p36891   \n",
       "0       1      1                 http://www.yso.fi/onto/koko/p52909   \n",
       "0       1      5                 http://www.yso.fi/onto/koko/p13034   \n",
       "0       1      3                  http://www.yso.fi/onto/koko/p3113   \n",
       "0       1      4                 http://www.yso.fi/onto/koko/p33980   \n",
       "0       1      1                  http://www.yso.fi/onto/koko/p3437   \n",
       "0       8     20                 http://www.yso.fi/onto/koko/p16897   \n",
       "0      38     74                  http://www.yso.fi/onto/koko/p2682   \n",
       "0       6      7                 http://www.yso.fi/onto/koko/p32570   \n",
       "0       2      4                   http://www.yso.fi/onto/koko/p745   \n",
       "0       2      3                 http://www.yso.fi/onto/koko/p11118   \n",
       "0    5681  17384                 http://www.yso.fi/onto/koko/p35259   \n",
       "0       1      1                 http://www.yso.fi/onto/koko/p17502   \n",
       "0       1      1                  http://www.yso.fi/onto/koko/p6292   \n",
       "0       2      2                 http://www.yso.fi/onto/koko/p34461   \n",
       "0       4      6                  http://www.yso.fi/onto/koko/p8327   \n",
       "0       6     17  http://seco.tkk.fi/saha3/u86d688aa-7a9f-4e6d-9...   \n",
       "0       1      1                 http://www.yso.fi/onto/koko/p32714   \n",
       "0       3      5                 http://www.yso.fi/onto/koko/p73101   \n",
       "\n",
       "                  label  \n",
       "0     afganistanilaiset  \n",
       "0       alankomaalaiset  \n",
       "0       australialaiset  \n",
       "0          inkeriläiset  \n",
       "0    inkerinsuomalaiset  \n",
       "0           intialaiset  \n",
       "0           iranilaiset  \n",
       "0         israelilaiset  \n",
       "0          kanadalaiset  \n",
       "0           karjalaiset  \n",
       "0           kiinalaiset  \n",
       "0          kosovolaiset  \n",
       "0      metsätyöntekijät  \n",
       "0                nainen  \n",
       "0  neuvostoliittolaiset  \n",
       "0           norjalaiset  \n",
       "0             opettajat  \n",
       "0          ranskalaiset  \n",
       "0          ruotsalaiset  \n",
       "0    ruotsinsuomalaiset  \n",
       "0           saamelaiset  \n",
       "0           saksalaiset  \n",
       "0               somalit  \n",
       "0           suomalaiset  \n",
       "0               tamilit  \n",
       "0          tanskalaiset  \n",
       "0          unkarilaiset  \n",
       "0            venäläiset  \n",
       "0     vienankarjalaiset  \n",
       "0            virolaiset  \n",
       "0      yhdysvaltalaiset  "
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "fidf=pd.DataFrame()\n",
    "for row in qres:\n",
    "    n = str(row.asdict()['kansallisuus'].toPython())   \n",
    "    natname = str(row.asdict()['label'].toPython())   \n",
    "    a = str(row.asdict()['authorcount'].toPython()) \n",
    "    w = str(row.asdict()['workcount'].toPython()) \n",
    "    temp=pd.DataFrame({\"authors\":a, \"novels\":w,\"nationality\":n, \"natname\":natname}.values() ).T.rename({0:\"authors\",1:\"novels\",2:\"nationality\",3:\"label\"},axis=1)\n",
    "    fidf=pd.concat([fidf,temp])\n",
    "    \n",
    "fidf.sort_values(by=\"label\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "id": "67d5e094",
   "metadata": {},
   "outputs": [],
   "source": [
    "# corrections similar to the translated works"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 103,
   "id": "11893491",
   "metadata": {},
   "outputs": [],
   "source": [
    "# englantilaiset => britit\n",
    "# skotit => britit\n",
    "\n",
    "tocorrect = [('http://www.yso.fi/onto/koko/p607','http://www.yso.fi/onto/koko/p2224'),('http://seco.tkk.fi/onto/toimo/nationalities/Scottish_Scots_','http://www.yso.fi/onto/koko/p2224'),\n",
    "             ('http://www.yso.fi/onto/koko/p16273','http://www.yso.fi/onto/koko/p2224'),('http://seco.tkk.fi/onto/toimo/nationalities/Hungarian','http://www.yso.fi/onto/koko/p34461')]\n",
    "\n",
    "# remove: opettajat, nainen, metsätyöntekijät\n",
    "todelete=[\"http://www.yso.fi/onto/koko/p36891\",\"http://www.yso.fi/onto/koko/p52909\",\"http://www.yso.fi/onto/koko/p33980\"]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 104,
   "id": "7a70faf6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://www.yso.fi/onto/koko/p607 http://www.yso.fi/onto/koko/p2224\n",
      "http://seco.tkk.fi/onto/toimo/nationalities/Scottish_Scots_ http://www.yso.fi/onto/koko/p2224\n",
      "http://www.yso.fi/onto/koko/p16273 http://www.yso.fi/onto/koko/p2224\n",
      "http://seco.tkk.fi/onto/toimo/nationalities/Hungarian http://www.yso.fi/onto/koko/p34461\n"
     ]
    }
   ],
   "source": [
    "for o,n in tocorrect:\n",
    "    old=o\n",
    "    new=n\n",
    "    print( old, new)\n",
    "    query=\"\"\"\n",
    "                 DELETE {?author rel:authorNationality <OLD> }\n",
    "                 INSERT { ?author rel:authorNationality  <NEW> }\n",
    "                 WHERE { ?author rel:authorNationality <OLD> }\n",
    "                 \"\"\"\n",
    "    q=query.replace(\"OLD\",old).replace(\"NEW\",new)\n",
    "    f.update(q)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 105,
   "id": "f199f87b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://www.yso.fi/onto/koko/p36891\n",
      "http://www.yso.fi/onto/koko/p52909\n",
      "http://www.yso.fi/onto/koko/p33980\n"
     ]
    }
   ],
   "source": [
    "\n",
    "for v in todelete:\n",
    "    old=v\n",
    "    #new=list(natlabel_lookup[n])\n",
    "    print(old)\n",
    "    query=\"\"\"\n",
    "                 DELETE {?author rel:authorNationality <OLD> }\n",
    "                 #INSERT { ?author rel:authorNationality  <NEW> }\n",
    "                 WHERE { ?author rel:authorNationality <OLD> }\n",
    "                 \"\"\"\n",
    "    q=query.replace(\"OLD\",old)#.replace(\"NEW\",new[0])\n",
    "    f.update(q)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "06e5839d",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/u/98/peurat1/unix/kirjasampo/benv/lib/python3.8/site-packages/rdflib/plugins/serializers/nt.py:36: UserWarning: NTSerializer always uses UTF-8 encoding. Given encoding was: utf8\n",
      "  warnings.warn(\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "<Graph identifier=N11e2fd8b4a624308bc0614b116ae860e (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# save the graph\n",
    "\n",
    "#f.serialize(destination=\"../../data/finnish_graph_new.nt\",format=\"nt\",encoding=\"utf8\")#.decode('utf8')\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "75f310a9",
   "metadata": {},
   "source": [
    "## correct things in theme graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "4ce163fd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=N5dfcfa9489f14d8fa8cf9daab2c991a1 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# cluster per genre information\n",
    "# load genre graphs\n",
    "l = Graph() \n",
    "l.parse(\"../../data/finnish_genre_theme.nt\",format=\"nt\")\n",
    "\n",
    "k = Graph() \n",
    "k.parse(\"../../data/translated_genre_theme.nt\",format=\"nt\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "24db6a2e",
   "metadata": {},
   "outputs": [],
   "source": [
    "# initial language lookup\n",
    "\n",
    "qres = k.query(\"\"\"\n",
    "#PREFIX kaunokki: <http://www.yso.fi/onto/kaunokki#> \n",
    "PREFIX rel: <http://ldf.fi/relse/> \n",
    "PREFIX dct: <http://purl.org/dc/terms/>\n",
    "PREFIX foaf: <http://xmlns.com/foaf/0.1/>\n",
    "PREFIX owl: <http://www.w3.org/2002/07/owl#>\n",
    "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\n",
    "PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>\n",
    "PREFIX schema: <http://schema.org/>\n",
    "PREFIX skos: <http://www.w3.org/2004/02/skos/core#>\n",
    "PREFIX xml: <http://www.w3.org/XML/1998/namespace>\n",
    "PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>\n",
    "\n",
    "SELECT DISTINCT ?lang\n",
    "WHERE {\n",
    "  ?teos a rel:novel ; rel:langOrig ?lang. \n",
    "  \n",
    "}  \"\"\")\n",
    "\n",
    "langlabel_lookup = {}\n",
    "\n",
    "for l in qres:\n",
    "    lang=l[\"lang\"].toPython()\n",
    "    #print(lang)\n",
    "    if lang not in langlabel_lookup.keys():\n",
    "        langlabel_lookup[lang]= lang.split(\"/\")[-1]\n",
    "    else:\n",
    "        print(\"oop\",lang)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "001598ce",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "dict_items([('http://lexvo.org/id/iso639-3/eng', 'eng'), ('http://lexvo.org/id/iso639-3/ita', 'ita'), ('http://lexvo.org/id/iso639-3/deu', 'deu'), ('http://lexvo.org/id/iso639-3/isl', 'isl'), ('http://lexvo.org/id/iso639-3/swe', 'swe'), ('http://lexvo.org/id/iso639-3/rus', 'rus'), ('http://lexvo.org/id/iso639-3/fra', 'fra'), ('http://lexvo.org/id/iso639-3/dan', 'dan'), ('http://lexvo.org/id/iso639-3/spa', 'spa'), ('http://lexvo.org/id/iso639-3/tur', 'tur'), ('http://lexvo.org/id/iso639-3/ces', 'ces'), ('http://lexvo.org/id/iso639-3/por', 'por'), ('http://lexvo.org/id/iso639-3/nor', 'nor'), ('http://lexvo.org/id/iso639-3/hin', 'hin'), ('http://lexvo.org/id/iso639-3/kor', 'kor'), ('http://lexvo.org/id/iso639-3/lav', 'lav'), ('http://lexvo.org/id/iso639-3/est', 'est'), ('http://lexvo.org/id/iso639-3/yid', 'yid'), ('http://lexvo.org/id/iso639-3/hun', 'hun'), ('http://lexvo.org/id/iso639-3/nld', 'nld'), ('http://lexvo.org/id/iso639-3/pol', 'pol'), ('http://lexvo.org/id/iso639-3/kat', 'kat'), ('http://lexvo.org/id/iso639-5/smi', 'smi'), ('http://www.lingvoj.org/lang/be-x-old', 'be-x-old'), ('http://lexvo.org/id/iso639-3/jpn', 'jpn'), ('http://lexvo.org/id/iso639-3/zho', 'zho'), ('http://lexvo.org/id/iso639-3/slk', 'slk'), ('http://lexvo.org/id/iso639-3/kur', 'kur'), ('http://lexvo.org/id/iso639-3/ben', 'ben'), ('http://lexvo.org/id/iso639-3/bul', 'bul'), ('http://lexvo.org/id/iso639-3/ara', 'ara'), ('http://lexvo.org/id/iso639-3/afr', 'afr'), ('http://lexvo.org/id/iso639-3/sqi', 'sqi'), ('http://lexvo.org/id/iso639-3/heb', 'heb'), ('http://lexvo.org/id/iso639-3/slv', 'slv'), ('http://lexvo.org/id/iso639-3/som', 'som'), ('http://lexvo.org/id/iso639-3/grc', 'grc'), ('http://lexvo.org/id/iso639-3/sme', 'sme'), ('http://lexvo.org/id/iso639-3/hye', 'hye'), ('http://lexvo.org/id/iso639-3/ron', 'ron'), ('http://lexvo.org/id/iso639-3/glg', 'glg'), ('http://lexvo.org/id/iso639-3/lit', 'lit'), ('http://lexvo.org/id/iso639-3/ell', 'ell'), ('http://www.lingvoj.org/lang/bnt', 'bnt'), ('http://lexvo.org/id/iso639-3/vie', 'vie'), ('http://www.lingvoj.org/lang/smi', 'smi'), ('http://lexvo.org/id/iso639-3/ind', 'ind'), ('http://lexvo.org/id/iso639-3/vec', 'vec'), ('http://lexvo.org/id/iso639-3/kik', 'kik'), ('http://lexvo.org/id/iso639-3/hbs', 'hbs'), ('http://lexvo.org/id/iso639-3/fas', 'fas'), ('http://www.lingvoj.org/lang/en-gb', 'en-gb'), ('http://lexvo.org/id/iso639-3/ukr', 'ukr'), ('http://lexvo.org/id/iso639-3/cat', 'cat'), ('http://lexvo.org/id/iso639-3/eus', 'eus'), ('http://lexvo.org/id/iso639-3/mkd', 'mkd'), ('http://lexvo.org/id/iso639-3/srp', 'srp'), ('http://lexvo.org/id/iso639-3/fit', 'fit'), ('http://lexvo.org/id/iso639-3/chm', 'chm'), ('http://lexvo.org/id/iso639-3/hrv', 'hrv'), ('http://lexvo.org/id/iso639-3/mul', 'mul'), ('http://www.lingvoj.org/lang/fiu', 'fiu'), ('http://lexvo.org/id/iso639-3/krl', 'krl'), ('http://lexvo.org/id/iso639-3/lat', 'lat'), ('http://lexvo.org/id/iso639-3/bos', 'bos')])\n"
     ]
    }
   ],
   "source": [
    "#\n",
    "print(langlabel_lookup.items())"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "3fa30591",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://www.lingvoj.org/lang/be-x-old be-x-old\n",
      "http://www.lingvoj.org/lang/bnt bnt\n",
      "http://www.lingvoj.org/lang/smi smi\n",
      "http://www.lingvoj.org/lang/en-gb en-gb\n",
      "http://www.lingvoj.org/lang/fiu fiu\n"
     ]
    }
   ],
   "source": [
    "oldlang=[]\n",
    "for key,v in langlabel_lookup.items():\n",
    "    if \"lexvo\" not in key:\n",
    "        print(key,v)\n",
    "        oldlang.append(key)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "id": "d120e54b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://lexvo.org/id/iso639-3/vec vec\n"
     ]
    }
   ],
   "source": [
    "for key,v in langlabel_lookup.items():\n",
    "    if \"vec\" in key:\n",
    "        print(key,v)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "e4529040",
   "metadata": {},
   "outputs": [],
   "source": [
    "# correct list\n",
    "# smi http://www.lexvo.org/page/iso639-5/smi\n",
    "# en-gb http://lexvo.org/id/iso639-3/eng\n",
    "# bnt http://www.lexvo.org/page/iso639-5/bnt\n",
    "# fiu http://www.lexvo.org/page/iso639-5/fiu\n",
    "# be-x-old http://www.lexvo.org/page/iso639-3/bel\n",
    "# 'http://lexvo.org/id/iso639-3/vec': 'vec',\n",
    "\n",
    "#newlang=[\"http://www.lexvo.org/page/iso639-5/smi\",\"http://lexvo.org/id/iso639-3/eng\",\"http://www.lexvo.org/page/iso639-5/bnt\",\n",
    "#        \"http://www.lexvo.org/page/iso639-5/fiu\",\"http://www.lexvo.org/page/iso639-3/bel\"]\n",
    "#updated= [\"http://lexvo.org/page/iso639-5/smi\",\"http://lexvo.org/id/iso639-3/eng\",\"http://lexvo.org/page/iso639-5/bnt\",\n",
    "#        \"http://lexvo.org/page/iso639-5/fiu\",\"http://lexvo.org/page/iso639-3/bel\"]\n",
    "updated= [\"http://lexvo.org/page/iso639-5/smi\",\"http://lexvo.org/id/iso639-3/eng\",\"http://lexvo.org/page/iso639-5/bnt\",\n",
    "        \"http://lexvo.org/page/iso639-5/fiu\"]\n",
    "newlang={\"http://www.lingvoj.org/lang/be-x-old\":\"http://lexvo.org/page/iso639-3/bel\",\"http://www.lingvoj.org/lang/bnt\":\"http://lexvo.org/page/iso639-5/bnt\",\"http://www.lingvoj.org/lang/smi\":\"http://lexvo.org/id/iso639-5/smi\",\"http://www.lingvoj.org/lang/fiu\":\"http://www.lexvo.org/page/iso639-5/fiu\",\"http://www.lingvoj.org/lang/en-gb\":\"http://lexvo.org/id/iso639-3/eng\",\"http://lexvo.org/id/iso639-3/vec\":'http://lexvo.org/id/iso639-3/rus'}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "id": "e7f128e6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://www.lingvoj.org/lang/be-x-old http://lexvo.org/page/iso639-3/bel\n",
      "http://www.lingvoj.org/lang/be-x-old http://lexvo.org/id/iso639-3/bel\n",
      "http://www.lingvoj.org/lang/bnt http://lexvo.org/page/iso639-5/bnt\n",
      "http://www.lingvoj.org/lang/bnt http://lexvo.org/id/iso639-5/bnt\n",
      "http://www.lingvoj.org/lang/smi http://lexvo.org/id/iso639-5/smi\n",
      "http://www.lingvoj.org/lang/smi http://lexvo.org/id/iso639-5/smi\n",
      "http://www.lingvoj.org/lang/fiu http://www.lexvo.org/page/iso639-5/fiu\n",
      "http://www.lingvoj.org/lang/fiu http://www.lexvo.org/id/iso639-5/fiu\n",
      "http://www.lingvoj.org/lang/en-gb http://lexvo.org/id/iso639-3/eng\n",
      "http://www.lingvoj.org/lang/en-gb http://lexvo.org/id/iso639-3/eng\n",
      "http://lexvo.org/id/iso639-3/vec http://lexvo.org/id/iso639-3/rus\n",
      "http://lexvo.org/id/iso639-3/vec http://lexvo.org/id/iso639-3/rus\n"
     ]
    }
   ],
   "source": [
    "for key,val in newlang.items():\n",
    "    \n",
    "    print(key,val)\n",
    "    old= key\n",
    "    new=val.replace(\"page\",\"id\")\n",
    "    print(old,new)\n",
    "    query=\"\"\"\n",
    "    PREFIX rel: <http://ldf.fi/relse/>\n",
    "             DELETE {?teos rel:langOrig <OLD> }\n",
    "             INSERT { ?teos rel:langOrig  <NEW> }\n",
    "             WHERE { ?teos rel:langOrig <OLD> }\n",
    "             \"\"\"\n",
    "    q=query.replace(\"OLD\",old).replace(\"NEW\",new)\n",
    "    k.update(q)\n",
    "    #print(\"After second update:\")\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "id": "f13c38ce",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/u/98/peurat1/unix/kirjasampo/benv/lib/python3.8/site-packages/rdflib/plugins/serializers/nt.py:36: UserWarning: NTSerializer always uses UTF-8 encoding. Given encoding was: None\n",
      "  warnings.warn(\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "<Graph identifier=N5dfcfa9489f14d8fa8cf9daab2c991a1 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 53,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# save\n",
    "k.serialize(destination=\"../../data/foreign_theme_genre.nt\",format=\"nt\")\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "book-venv",
   "language": "python",
   "name": "book-venv"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
